[{"SeriesTitle":"100% Real Hunting","SeriesID":"1000","EpisodeTitle":"Brenda KS Whitetail","EpisodeDescription":"If Brenda Valentine is too sick with the flu to hunt, she’s truly sick! But when she’s in Kansas hunting whitetails, she’ll find the strength to go anyway! Big Kansas bucks pull Brenda out of the sick bed and into a stand where she won’t regret her choice. Multiple cameras, no recreations, its 100% Real Hunting!","NewEpisode":"NO","Timeslots":[{"src":"THU 10:30AM","rdate":"2014\/03\/27","rtime":"10:30:00"},{"src":"SAT 6:00AM","rdate":"2014\/03\/29","rtime":"06:00:00"}]},{"SeriesTitle":"100% Real Hunting","SeriesID":"1000","EpisodeTitle":"Allen Treadwell Alaska Black Bear","EpisodeDescription":"Allen Treadwell is deep in Alaska bear country, but the bruins are high in the mountains, so there’s only one choice: Climb! Allen’s only chance is a last-day, four-hour-march, up-hill where exhaustion and a fast moving bear may prove too much of a challenge! Multiple cameras, no recreations, its 100% Real Hunting!","NewEpisode":"YES","Timeslots":[{"src":"SAT 9:30PM","rdate":"2014\/03\/29","rtime":"21:30:00"},{"src":"SUN 12:30AM","rdate":"2014\/03\/30","rtime":"00:30:00"}]},{"SeriesTitle":"Addictive Fishing","SeriesID":"1002","EpisodeTitle":"San Clemente","EpisodeDescription":"Join us this week as Capt. Blair Wiggins fishes for calico bass 50 miles off of California around San Clemente Island with Justin Reynolds.","NewEpisode":"NO","Timeslots":[{"src":"WED 3:00PM","rdate":"2014\/03\/26","rtime":"15:00:00"},{"src":"FRI 2:00AM","rdate":"2014\/03\/28","rtime":"02:00:00"}]},{"SeriesTitle":"Addictive Fishing","SeriesID":"1002","EpisodeTitle":"Catalina Blue","EpisodeDescription":"Join us this week as Capt. Blair Wiggins heads out to Southern California to fish off of Catalina Island for Calico Bass with Eric Dent.","NewEpisode":"NO","Timeslots":[{"src":"SUN 10:00AM","rdate":"2014\/03\/30","rtime":"10:00:00"}]},{"SeriesTitle":"Alaska's Fishing Paradise","SeriesID":"1004","EpisodeTitle":"Local Heroes","EpisodeDescription":"A brand new ship is a big deal especially when it’s named after owner Mark Power’s beloved mother. Join in on Captain Andy Schultz as he heads out on the maiden voyage of the Stella Mae guiding a spirited bunch of anglers who want to make this first trip a memorable one. Then we’ll meet up with veteran Captain Garfield George and his crew of fishermen who hit the mother lode on a Silver run. Tune in and find out why Whalers Cove is a fisherman’s paradise. ","NewEpisode":"NO","Timeslots":[{"src":"WED 7:30AM","rdate":"2014\/03\/26","rtime":"07:30:00"},{"src":"FRI 3:30AM","rdate":"2014\/03\/28","rtime":"03:30:00"}]},{"SeriesTitle":"Alaska's Fishing Paradise","SeriesID":"1004","EpisodeTitle":"Monster From the Deep","EpisodeDescription":"It’s early July at Whalers Cove Lodge and the bite is on. Join Captain Andy Schultz and his boatload of avid fishermen as they ply the Inside Passage for salmon and halibut. Later, meet Captain Doug McQuilliam and his clients Larry and Wilma who find the deep waters of Chatham Strait harbor some very large dwellers.","NewEpisode":"NO","Timeslots":[{"src":"SUN 2:30PM","rdate":"2014\/03\/30","rtime":"14:30:00"}]},{"SeriesTitle":"AROtv","SeriesID":"1009","EpisodeTitle":"Getting Stung","EpisodeDescription":"Zach and Jerry put their bows away as the Missouri Firearms season opens. High winds and warm temps will not make it easy on the guys as the attempt to fill their tags with their crossbows. ","NewEpisode":"NO","Timeslots":[{"src":"WED 4:00PM","rdate":"2014\/03\/26","rtime":"16:00:00"},{"src":"FRI 9:30AM","rdate":"2014\/03\/28","rtime":"09:30:00"}]},{"SeriesTitle":"AROtv","SeriesID":"1009","EpisodeTitle":"Getting Stung","EpisodeDescription":"Zach and Jerry put their bows away as the Missouri Firearms season opens. High winds and warm temps will not make it easy on the guys as the attempt to fill their tags with their crossbows. ","NewEpisode":"NO","Timeslots":[{"src":"SUN 12:30PM","rdate":"2014\/03\/30","rtime":"12:30:00"}]},{"SeriesTitle":"Bowhunter TV","SeriesID":"1016","EpisodeTitle":"Winter Bull","EpisodeDescription":"Get ready to throw another log on the fire as “Hunting Whitetails” Columnist C.J. Winand heads to northern Alberta in search of wood bison. This is a true endurance test featuring long days, plunging temperatures, thigh-deep snow – and one big, wooly critter. In “Tech Talk,” Mike Carney and Equipment Editor Tony Peterson talk about what you can learn from a shooting machine, and later, in the “Moment of Truth” segment, Editor Curt Wells will teach you how to prep for cold weather bowhunting.","NewEpisode":"NO","Timeslots":[{"src":"TUE 7:30AM","rdate":"2014\/03\/25","rtime":"07:30:00"},{"src":"WED 9:00AM","rdate":"2014\/03\/26","rtime":"09:00:00"}]},{"SeriesTitle":"Bowhunter TV","SeriesID":"1016","EpisodeTitle":"Missed Opportunities","EpisodeDescription":"Unfortunately, the Bowhunter crew knows only too well that sometimes the best way to learn is through your mistakes. In this educational episode, the staff will re-live some of their mistakes, close calls, and misses near and far. Also in this program’s “Tech Talk” segment, Host Mike Carney and Equipment Editor Tony Peterson achieve proper bow balance with accessories, and Randy Ulmer’s “Dead On” segment finishes up with tips on making adjustments to draw length.","NewEpisode":"YES","Timeslots":[{"src":"FRI 8:00PM","rdate":"2014\/03\/28","rtime":"20:00:00"},{"src":"FRI 11:00PM","rdate":"2014\/03\/28","rtime":"23:00:00"}]},{"SeriesTitle":"Brad Farris' Game Plan ","SeriesID":"1017","EpisodeTitle":"Will Primos Style","EpisodeDescription":"This week Brad is hunting in MS with two great friends, Will Primos and Tommy Howard. It’s rut time and techniques change. Whitetail hunters look forward to the rut because it is the time of year that gets those mature bucks up and moving. It is also the time when they are chasing and this can bring a few challenges as well. In this episode, see how Brad and Will used CRP, Food Plots, and some anticipation to create the “perfect” spot.","NewEpisode":"NO","Timeslots":[{"src":"TUE 10:30PM","rdate":"2014\/03\/25","rtime":"22:30:00"},{"src":"WED 1:30AM","rdate":"2014\/03\/26","rtime":"01:30:00"},{"src":"WED 2:30PM","rdate":"2014\/03\/26","rtime":"14:30:00"},{"src":"SAT 7:00AM","rdate":"2014\/03\/29","rtime":"07:00:00"}]},{"SeriesTitle":"Brotherhood Outdoors","SeriesID":"1018","EpisodeTitle":"Memory Filled Idaho Elk Hunt","EpisodeDescription":"Confronting Idaho’s steep terrain and high altitude, Gene Barnes—a union machinist—sets his sights on helping his 74-year-old father, Harlyn Barnes, harvest a bull elk in memory of his late son and the cherished hunting trips the three of them shared together. As the group hikes to 7,500 feet in elevation to a lookout point on day one, Brotherhood Outdoors co-hosts Daniel Lee Martin and Julie McQueen are impressed by Haryln’s sheer determination. You will be too when you tune in.","NewEpisode":"NO","Timeslots":[{"src":"MON 4:30PM","rdate":"2014\/03\/24","rtime":"16:30:00"},{"src":"TUE 2:30AM","rdate":"2014\/03\/25","rtime":"02:30:00"},{"src":"TUE 6:00AM","rdate":"2014\/03\/25","rtime":"06:00:00"}]},{"SeriesTitle":"Brotherhood Outdoors","SeriesID":"1018","EpisodeTitle":"Hooked on Florida Silver King","EpisodeDescription":"Brotherhood Outdoors honors Brad Richmond, a union operating engineer from Illinois, for his efforts to bring hope and healing to children with a trip to Florida’s famed Boca Grande to battle trophy tarpon. Brad, who organizes an annual Casting for a Cure catfishing tournament to raise funds and awareness for St. Jude's Children's Medical Center, quickly discovers that fishing for catfish is a lot different than hooking into the Silver King! ","NewEpisode":"YES","Timeslots":[{"src":"SUN 11:00AM","rdate":"2014\/03\/30","rtime":"11:00:00"}]},{"SeriesTitle":"Bullets & Broadheads","SeriesID":"1021","EpisodeTitle":"Bitter Cold Big Bulls","EpisodeDescription":"Bitter Cold weather and Big Bulls. After years of putting in for the draw. Michael finally draws out for a Elk Tag, Michael heads West to in search of a big bull elk. Having to leave the bow back in Texas Michael zeros his rifle in for a chance at a trophy bull.\nIn despair and bad luck Michael meets Brad Probst of Bear Mountain Ranch. \n","NewEpisode":"NO","Timeslots":[{"src":"TUE 11:00AM","rdate":"2014\/03\/25","rtime":"11:00:00"}]},{"SeriesTitle":"Bullets & Broadheads","SeriesID":"1021","EpisodeTitle":"Rain, Sleet & Persistence","EpisodeDescription":"Texas is known for Big deer and unpredictable weather and you never know what either of them is going to show up. Sonia is hunting in central Texas at the 9000 acre Solana Ranch when down pours turn into freezing rain and high winds. Fighting the odds with weather and camera gear Sonia braves the elements to track down her Buck. ","NewEpisode":"YES","Timeslots":[{"src":"SUN 7:00PM","rdate":"2014\/03\/30","rtime":"19:00:00"},{"src":"MON 4:00AM","rdate":"2014\/03\/24","rtime":"04:00:00"}]},{"SeriesTitle":"Canada in the Rough","SeriesID":"1022","EpisodeTitle":"Massive Yukon Ram","EpisodeDescription":"Kevin Beasley heads to the Yukon to hunt with Tombstone Wilderness Adventures! Kevin will be chasing Mountain Sheep and at one point, has 7 legal rams on one mountain range in front of him. While stalking in on a 10-1\/2 year old ram, a horrendous blizzard blew in and almost blew them off the mountain! This was a hunt that challenged the crew in every way. Tune in to see how perseverance paid off!","NewEpisode":"NO","Timeslots":[{"src":"THU 9:00AM","rdate":"2014\/03\/27","rtime":"09:00:00"}]},{"SeriesTitle":"Canada in the Rough","SeriesID":"1022","EpisodeTitle":"Moose Madness","EpisodeDescription":"The Canada in the Rough crew heads to Quebec in search of a bull moose! Keith Beasley will be alongside John Mock of Stoeger Canada and Kari Kuparinen from Sako International. With lots of moose sightings the boys finally get to pull the trigger on a gorgeous bull moose!","NewEpisode":"YES","Timeslots":[{"src":"SAT 8:00PM","rdate":"2014\/03\/29","rtime":"20:00:00"},{"src":"SAT 11:00PM","rdate":"2014\/03\/29","rtime":"23:00:00"}]},{"SeriesTitle":"Combat School","SeriesID":"1026","EpisodeTitle":"Hidden Enemies","EpisodeDescription":"Without their leader One Platoon is assigned to a remote forward operating base for guard duty. Major Oberwarth becomes stretched for resources after a mock suicide bomber causes mass casualties. In One Platoon’s absence, Two Platoon is sent to save an important VIP from a downed helicopter, but may be driving into an ambush. ","NewEpisode":"YES","Timeslots":[{"src":"THU 9:00PM","rdate":"2014\/03\/27","rtime":"21:00:00"},{"src":"THU 9:30PM","rdate":"2014\/03\/27","rtime":"21:30:00"},{"src":"FRI 12:00PM","rdate":"2014\/03\/28","rtime":"12:00:00"},{"src":"FRI 12:30AM","rdate":"2014\/03\/28","rtime":"00:30:00"},{"src":"FRI 1:00PM","rdate":"2014\/03\/28","rtime":"13:00:00"},{"src":"FRI 1:30PM","rdate":"2014\/03\/28","rtime":"13:30:00"},{"src":"FRI 7:00PM","rdate":"2014\/03\/28","rtime":"19:00:00"},{"src":"FRI 7:30PM","rdate":"2014\/03\/28","rtime":"19:30:00"}]},{"SeriesTitle":"Dead Dog Walkin'","SeriesID":"1030","EpisodeTitle":"The Trap is Set Pt. 2","EpisodeDescription":"The Dead Dog Walkin’ crew is back in the Nevada desert with trapper Jim Saling. Just when they thought they knew all about predator control, Jim shows them a whole new world! From the tried and true old school methods, to some new ways to target bobcats, Jim is putting on a clinic. The team also could not resist showing Jim their preferred ways of protecting wildlife and livestock; these episodes truly have it all!","NewEpisode":"NO","Timeslots":[{"src":"TUE 2:00PM","rdate":"2014\/03\/25","rtime":"14:00:00"}]},{"SeriesTitle":"Dead Dog Walkin'","SeriesID":"1030","EpisodeTitle":"Coyote Loco Pt. 1","EpisodeDescription":"Old Mexico is overrun with coyotes! The Dead Dog Walkin’ team is headed south of the border to help Buro Crazy Outfitters thin out the packs a little. Northern Mexico is known for huge mule deer, but an over population of predator threatens their young every year. Join the team this week as they help a fledgling deer-management ranch control it’s predator population, to insure plenty of trophy bucks for years to come! ","NewEpisode":"NO","Timeslots":[{"src":"SUN 10:00PM","rdate":"2014\/03\/30","rtime":"22:00:00"},{"src":"MON 1:00AM","rdate":"2014\/03\/24","rtime":"01:00:00"}]},{"SeriesTitle":"Dead Meat","SeriesID":"1031","EpisodeTitle":"Where the Hell is Swinney Switch?","EpisodeDescription":"Featured on “River Monsters” and weighing up to 400 pounds, the alligator gar is vicious, armor-plated and most often thought of as a “trash fish”. Chef Leysath heads to Nowhere, Texas to meet up with a couple of water-worn gar anglers who go the distance to put him on this potentially inedible fighting fish. Of course, if he can catch them, he’s going to want to eat them. As long as he’s in the neighborhood, Leysath tries to see if he can turn gar bait into dinner at the local bar. Better get you a cold one.","NewEpisode":"NO","Timeslots":[{"src":"THU 8:30PM","rdate":"2014\/03\/27","rtime":"20:30:00"},{"src":"THU 11:30PM","rdate":"2014\/03\/27","rtime":"23:30:00"},{"src":"FRI 12:30PM","rdate":"2014\/03\/28","rtime":"12:30:00"}]},{"SeriesTitle":"Dog Soldier TV","SeriesID":"1033","EpisodeTitle":"Call Grabbing Action at Rawhide Camp","EpisodeDescription":"The DogSoldier Steve Criner heads to Highland Kansas to hunt with dogs with Regulator Heath Whetstine at Rawhide Camp. Coyotes grabbing the call and hardcore calling action, this episode is one that's hard to beat. Full of old school howling, and calling, the guys lay the coyotes down.","NewEpisode":"NO","Timeslots":[{"src":"TUE 2:00AM","rdate":"2014\/03\/25","rtime":"02:00:00"},{"src":"TUE 2:30PM","rdate":"2014\/03\/25","rtime":"14:30:00"}]},{"SeriesTitle":"Dog Soldier TV","SeriesID":"1033","EpisodeTitle":"Hog Stomped in Arkansas","EpisodeDescription":"The DogSoldier Steve Criner heads to Arkansas to hunt hogs with dogs with PBR bulrider Justin Koon and his cousins Brian Skorz and Kieth Dempsey. Criner, taking a solid hooking from a hog rebounds and wages war on the hogs. This episode is packed full of PBR avtion and hogdoggin at its best. ","NewEpisode":"YES","Timeslots":[{"src":"SUN 10:30PM","rdate":"2014\/03\/30","rtime":"22:30:00"},{"src":"MON 1:30AM","rdate":"2014\/03\/24","rtime":"01:30:00"}]},{"SeriesTitle":"Doug Koenig's Championship Season","SeriesID":"1034","EpisodeTitle":"Wyoming Elk Part 1","EpisodeDescription":"Doug Koenig takes the Championship Season to Wyoming this week in search of screaming bull elk…. Carl Bernosky joins the adventure and is looking to take his first bull ever with a TenPoint crossbow. High mountains and bull elk this week on the Championship Season! ","NewEpisode":"NO","Timeslots":[{"src":"TUE 4:00PM","rdate":"2014\/03\/25","rtime":"16:00:00"},{"src":"WED 3:30AM","rdate":"2014\/03\/26","rtime":"03:30:00"}]},{"SeriesTitle":"Doug Koenig's Championship Season","SeriesID":"1034","EpisodeTitle":"Wyoming Elk Part 2","EpisodeDescription":"Doug Koenig takes the Championship Season to Wyoming this week in search of screaming bull elk…. Doug is taking on the bowhunting challenge head on, and is hoping to take his first bull ever with a TenPoint crossbow. High mountains, extreme hunting, and screaming bull elk this week on the Championship Season! ","NewEpisode":"YES","Timeslots":[{"src":"SUN 11:30AM","rdate":"2014\/03\/30","rtime":"11:30:00"}]},{"SeriesTitle":"DreamPoint’s \"Extend Your Range\" TV","SeriesID":"1036","EpisodeTitle":"Wyoming Combo","EpisodeDescription":"Justin Olk and the DreamPoint crew are back in Wyoming with Tyler Sims Outfitting for a combo Antelope\/Mule Deer archery hunt. After Justin locates a bachelor group of 11 bucks the entire week is dedicated to arrowing of the two biggest. It’s pulse pounding action day after day as this hunt proves to be more difficult than first anticipated.","NewEpisode":"YES","Timeslots":[{"src":"WED 10:30PM","rdate":"2014\/03\/26","rtime":"22:30:00"},{"src":"THU 1:30AM","rdate":"2014\/03\/27","rtime":"01:30:00"},{"src":"THU 2:30PM","rdate":"2014\/03\/27","rtime":"14:30:00"}]},{"SeriesTitle":"Dressed to Kill","SeriesID":"1037","EpisodeTitle":"Bear N Grin","EpisodeDescription":"Krysten McDaniels and Dusty Perilo head north to Canada looking for excitement on their first trip hunting black bears.","NewEpisode":"NO","Timeslots":[{"src":"MON 10:30AM","rdate":"2014\/03\/24","rtime":"10:30:00"},{"src":"WED 4:30AM","rdate":"2014\/03\/26","rtime":"04:30:00"}]},{"SeriesTitle":"Dressed to Kill","SeriesID":"1037","EpisodeTitle":"Mule Deer Down","EpisodeDescription":"Lindsey Ewert is no professional archer but her first shot at a mule deer has her looking like she is.","NewEpisode":"YES","Timeslots":[{"src":"SAT 6:30PM","rdate":"2014\/03\/29","rtime":"18:30:00"}]},{"SeriesTitle":"Elite Archery's Respect the Game TV","SeriesID":"1041","EpisodeTitle":"Rutting Midwestern Bucks","EpisodeDescription":"The rut is on across the Midwest and the Elite Crew is taking advantage of some cool temperatures and hot does. We go back to outfitter, Bryant Shermoe and Shermoe Adventures in Southwest Iowa, where big bucks run the show. After a short sit, Chad Johnson, realizes this will be his whitetail hunt of a lifetime. And then in Illinois where hard work and determination pay off for Clark Cummings as his Elite bow comes through and a great buck hits the ground. ","NewEpisode":"YES","Timeslots":[{"src":"TUE 9:00PM","rdate":"2014\/03\/25","rtime":"21:00:00"},{"src":"WED 12:00AM","rdate":"2014\/03\/26","rtime":"00:00:00"},{"src":"WED 1:00PM","rdate":"2014\/03\/26","rtime":"13:00:00"},{"src":"SUN 3:30AM","rdate":"2014\/03\/30","rtime":"03:30:00"}]},{"SeriesTitle":"Excalibur's Huntin' the Backwoods","SeriesID":"1042","EpisodeTitle":"Ignace Outposts","EpisodeDescription":"Dan and Troy head north to Ontario for a fly-in moose hunt with Ignace Outpost Outfitters. This area is known for big bulls, and it doesn’t disappoint. Troy comes face-to-face with a massive Ontario bull and puts the Excalibur Crossbow to good use during his first moose hunt. Then, Dan and his guide Joey spot a bull in the thicket and put a long, arduous stalk on him.","NewEpisode":"NO","Timeslots":[{"src":"MON 11:00AM","rdate":"2014\/03\/24","rtime":"11:00:00"},{"src":"FRI 4:00AM","rdate":"2014\/03\/28","rtime":"04:00:00"},{"src":"FRI 4:30PM","rdate":"2014\/03\/28","rtime":"16:30:00"}]},{"SeriesTitle":"Excalibur's Huntin' the Backwoods","SeriesID":"1042","EpisodeTitle":"A Texas Tradition","EpisodeDescription":"Texas is infested with wild pigs, so Dan Wallace and the Boys talked to Bob Detharow at Hunters Creek Ranch in northeast Texas about coming down to get some pigs for the freezer. Bob and Paul start things off with a spot-and-stalk on a group of pigs in the thicket and have to practice some patience in the process. Then, to speed things up a bit, Bob brings out the hog dogs and Shawn and Dan partake in a Texas Tradition, while Taft love does a little predator calling and finds an unlikely guest.","NewEpisode":"YES","Timeslots":[{"src":"SAT 7:00PM","rdate":"2014\/03\/29","rtime":"19:00:00"}]},{"SeriesTitle":"Extreme Angler TV","SeriesID":"1043","EpisodeTitle":"Slop Silly Largemouth","EpisodeDescription":"When it comes to hot weather largemouth bass fishing, no location is too thick or too shallow to hold bigger than average bass. On this episode, Karl uses ninja like tactics to sneak up on skinny water bass with soft perfect plastics and heavy gear. ","NewEpisode":"NO","Timeslots":[{"src":"THU 3:30PM","rdate":"2014\/03\/27","rtime":"15:30:00"},{"src":"FRI 6:30AM","rdate":"2014\/03\/28","rtime":"06:30:00"}]},{"SeriesTitle":"Extreme Angler TV","SeriesID":"1043","EpisodeTitle":"Smallmouth Splash","EpisodeDescription":"One of the oldest and most enjoyable ways to catch smallmouth bass is with top water baits. The hooksets and tail walking bass are plentiful on this episode using the new KVD splash bait in early summer. ","NewEpisode":"YES","Timeslots":[{"src":"SAT 8:30AM","rdate":"2014\/03\/29","rtime":"08:30:00"}]},{"SeriesTitle":"Extreme Outer Limits","SeriesID":"1044","EpisodeTitle":"Nightforce Optics Tour, Part 1","EpisodeDescription":"Bob Beck travels to Orofino, Idaho to get a behind the scenes tour of the Nightforce facility and learns what all goes into making precision optics. Part 1","NewEpisode":"NO","Timeslots":[{"src":"TUE 7:00AM","rdate":"2014\/03\/25","rtime":"07:00:00"},{"src":"FRI 5:00PM","rdate":"2014\/03\/28","rtime":"17:00:00"}]},{"SeriesTitle":"Extreme Outer Limits","SeriesID":"1044","EpisodeTitle":"Nightforce Optics Tour, Part 2","EpisodeDescription":"Bob Beck travels to Orofino, Idaho to get a behind the scenes tour of the Nightforce facility and learns what all goes into making precision optics. Part 2","NewEpisode":"YES","Timeslots":[{"src":"SAT 12:30PM","rdate":"2014\/03\/29","rtime":"12:30:00"}]},{"SeriesTitle":"Forever Wild Outdoors Adrenaline Adventures","SeriesID":"1047","EpisodeTitle":"Bears N' Bucks","EpisodeDescription":"FWO Pro Staffer Ralph Lowry travels to Haynesville, Maine in pursuit of his first black bear. Can Ralph keep it together on his first out-of-state hunt, especially when that black bear comes into his view Get to know the guys at Katahdin’s Shadow Outfitters as they guide Ralph on his adrenaline adventure. Then it’s off to Western NY, where Mark Goreski od Antler Ice tries to -bag an Empire State Buck. Emotions run high in this action-packed episode","NewEpisode":"NO","Timeslots":[{"src":"THU 7:30AM","rdate":"2014\/03\/27","rtime":"07:30:00"},{"src":"SAT 3:30AM","rdate":"2014\/03\/29","rtime":"03:30:00"}]},{"SeriesTitle":"Forever Wild Outdoors Adrenaline Adventures","SeriesID":"1047","EpisodeTitle":"A Tale of Two Continents","EpisodeDescription":"Co-host Gerry Rightmyer travels to the eastern cape of South Africa in search of a trophy warthog. With the help of Bluecliffe Safaris, PH Harry Sparks helps Gerry navigate the bushveldt. Then back in the states, Gerry heads to Maine to pursue his quest of killing a trophy bear with his muzzleloader. ","NewEpisode":"YES","Timeslots":[{"src":"SUN 4:00PM","rdate":"2014\/03\/30","rtime":"16:00:00"}]},{"SeriesTitle":"G3 Sportsman","SeriesID":"1050","EpisodeTitle":"Tank Ducks","EpisodeDescription":"Host Scott Turnage hunts ducks on Texas stock tanks with fellow hunter Kirk Kirkland southwest of Dallas. ","NewEpisode":"NO","Timeslots":[{"src":"THU 4:00PM","rdate":"2014\/03\/27","rtime":"16:00:00"},{"src":"FRI 10:30AM","rdate":"2014\/03\/28","rtime":"10:30:00"}]},{"SeriesTitle":"G3 Sportsman","SeriesID":"1050","EpisodeTitle":"Winter Spoonies","EpisodeDescription":"Host Scott Turnage gets introduced to an effective way of snagging large spoonbill (paddlefish) with Rusty Pritchard on Grand Lake Oklahoma. ","NewEpisode":"YES","Timeslots":[{"src":"SUN 1:30PM","rdate":"2014\/03\/30","rtime":"13:30:00"}]},{"SeriesTitle":"Gun Talk Television","SeriesID":"1052","EpisodeTitle":"Modern Sporting Rifles","EpisodeDescription":"This week on Gun Talk Television, hosts Tom Gresham and Ryan Gresham examine the past and present of the Modern Sporting Rifle, or MSR for short. Springfield Armory’s Rob Leatham and Louisiana Shooting Associations’ Dan Zelenka explore the history of the Springfield Armory M1A, while Ruger’s Mark Gurney discusses how the Mini-14 came about. Then it’s on to Jim Clark of Clark’s Custom Guns with his custom rifles designed for 3Gun competitions, and KelTec’s Rifle, Forward-ejecting Bullpup (or RFB) and lightweight SU16 rifle with a folding stock and bi-pod. Finally, Tom takes to the range with one of his favorite MSRs – the Ruger 10\/22, and explains the importance of using the right ammunition from companies like Nosler and Black Hills Ammunition that are offering different loads and different bullets for any Modern Sporting Rifle need.","NewEpisode":"YES","Timeslots":[{"src":"MON 10:30PM","rdate":"2014\/03\/24","rtime":"22:30:00"},{"src":"TUE 1:30AM","rdate":"2014\/03\/25","rtime":"01:30:00"},{"src":"TUE 5:30PM","rdate":"2014\/03\/25","rtime":"17:30:00"}]},{"SeriesTitle":"Guns & Ammo ","SeriesID":"1053","EpisodeTitle":"6-2014","EpisodeDescription":"The content just keeps getting better on G&A TV as we look “over the shoulder” of writer Tom Beckstrand and a SIG Academy instructor to check out the CAPS (Canadian Academy Practical Shooting) simulator system that is used to train attendees on a variety of “real world” situations where you may have to defend yourself or your family. We then turn our attention to new products, including Stag’s new and first ever .308, Ruger’s first American .22 rimfire bolt-action rifle, and Hornady’s new whitetail slug load. We then offer up a serious discussion between two law enforcement officers, who talk about the importance of being able to reload your firearm quickly. It could be a matter of life and death.","NewEpisode":"YES","Timeslots":[{"src":"MON 8:00PM","rdate":"2014\/03\/24","rtime":"20:00:00"},{"src":"MON 11:00PM","rdate":"2014\/03\/24","rtime":"23:00:00"},{"src":"TUE 5:00PM","rdate":"2014\/03\/25","rtime":"17:00:00"},{"src":"WED 6:30AM","rdate":"2014\/03\/26","rtime":"06:30:00"}]},{"SeriesTitle":"Guns & Gear","SeriesID":"1054","EpisodeTitle":"Long Guns & Australian Ammo","EpisodeDescription":"This week, hosts Tom Gresham and Ryan Gresham check out the all-weather ammunition from Australian Outback, Short Barrel Rifles(SBRs) from Stag Arms, Ruger’s stainless steel Scout rifle with an 18” barrel, a universal shotgun laser trainer from LaserLyte, compact pistols from Springfield Armory, Sig Sauer’s SSG 3000 and 716 Precision rifles, and more!","NewEpisode":"YES","Timeslots":[{"src":"MON 8:30PM","rdate":"2014\/03\/24","rtime":"20:30:00"},{"src":"MON 11:30PM","rdate":"2014\/03\/24","rtime":"23:30:00"},{"src":"WED 5:00PM","rdate":"2014\/03\/26","rtime":"17:00:00"}]},{"SeriesTitle":"Handguns","SeriesID":"1056","EpisodeTitle":"Handgun Penetration","EpisodeDescription":"The Roaring ‘20s and Lawless ‘30s saw a new breed of criminal arise who was better armed and more willing to use violence than his predecessors, he newly popular automobile gave these gangsters the ability to commit crimes and elude pursuit, the introduction of the “bullet proof” vest and the growing use of ballistic body armor all led to the introduction of new cartridges designed to provide superior penetration. This week Handguns examines some of the handguns and cartridges that were designed to give the “good guys” a better chance.","NewEpisode":"NO","Timeslots":[{"src":"MON 5:00PM","rdate":"2014\/03\/24","rtime":"17:00:00"}]},{"SeriesTitle":"Hot Shots","SeriesID":"1061","EpisodeTitle":"No Man's Land","EpisodeDescription":"Clint makes one of the most costly miscalculations of his career, and Jerry tries to steal a win; Max attempts to make history at the World Speed Shooting Championship.","NewEpisode":"YES","Timeslots":[{"src":"MON 9:00PM","rdate":"2014\/03\/24","rtime":"21:00:00"},{"src":"TUE 12:00AM","rdate":"2014\/03\/25","rtime":"00:00:00"},{"src":"WED 5:30PM","rdate":"2014\/03\/26","rtime":"17:30:00"}]},{"SeriesTitle":"Hunter's Specialties","SeriesID":"1062","EpisodeTitle":"Decoy Destruction","EpisodeDescription":"Wayne Shaw and Rick White are putting the new Snood turkey decoys to the test in Georgia and Iowa. The gobblers are tuff on the decoysd, Wayne and Rick are even tuffer. ","NewEpisode":"NO","Timeslots":[{"src":"MON 9:30AM","rdate":"2014\/03\/24","rtime":"09:30:00"},{"src":"THU 4:30PM","rdate":"2014\/03\/27","rtime":"16:30:00"}]},{"SeriesTitle":"Hunter's Specialties","SeriesID":"1062","EpisodeTitle":"C&D Farms Turkey Shoot Off","EpisodeDescription":"Dave & Carman Forbes get competitive as they turkey hunt in C&D in Missouri. ","NewEpisode":"YES","Timeslots":[{"src":"SUN 1:00PM","rdate":"2014\/03\/30","rtime":"13:00:00"}]},{"SeriesTitle":"Hunting Adventures","SeriesID":"1064","EpisodeTitle":"Dieter Kaboth Hunts Caribou","EpisodeDescription":"Join Co- Host Dieter Kaboth as he ticks off another hunt from his bucket list. This week he travels to the frozen tundra of the northern Quebec to hunt Caribou with Jack Hume Adventures. ","NewEpisode":"NO","Timeslots":[{"src":"TUE 3:00AM","rdate":"2014\/03\/25","rtime":"03:00:00"},{"src":"WED 6:00AM","rdate":"2014\/03\/26","rtime":"06:00:00"}]},{"SeriesTitle":"Hunting Adventures","SeriesID":"1064","EpisodeTitle":"North Country Moose","EpisodeDescription":"Co- Host Dieter Kaboth heads to Manitoba to chase the North American moose. These big animals surprise the guys with their wariness and ability to disappear and thrive in the thick bush of Manitoba. ","NewEpisode":"NO","Timeslots":[{"src":"SAT 12:00PM","rdate":"2014\/03\/29","rtime":"12:00:00"}]},{"SeriesTitle":"IGFA Angler's Digest","SeriesID":"1066","EpisodeTitle":"Buena Vista Resort, East Cape, Baja","EpisodeDescription":"Join host Bill Boyce as he drives down the Baja peninsula to one of his favorite fishing and diving spots, in Los Barriles, Baja. Joining resort owners Axel and Felipe Valdez as well as dive master Mark Rayor, they take the viewers beach fishing, offshore fishing and scuba diving in the Cabo Pulmo National Park. A great mix of the exciting watery world will be enjoyed by all in this episode. ","NewEpisode":"NO","Timeslots":[{"src":"MON 7:30AM","rdate":"2014\/03\/24","rtime":"07:30:00"},{"src":"THU 3:00PM","rdate":"2014\/03\/27","rtime":"15:00:00"},{"src":"FRI 3:00AM","rdate":"2014\/03\/28","rtime":"03:00:00"}]},{"SeriesTitle":"IGFA Angler's Digest","SeriesID":"1066","EpisodeTitle":"San Jose Del Cabo, Baja","EpisodeDescription":"The stunning seaside city of San Jose Del Cabo is featured in this amazing adventure. Not only is the excellent striped marlin fishery sampled with great success, the inshore roosterfish are given a test from the deck of the fishy 35’ Cabo Sportfisher, the FISHER MAN with Captain Jorge and mate Louis. This amazing fishery was to be further enhanced by the onshore amenities that are prominently featured in this episode. The world class marina Puerto Los Cabos, the golf courses, the sculpture parks, cactus plantation, art deco district, and fine dining all put the viewer on vacation right in the driver’s seat with the Anglers Digest crew. ","NewEpisode":"NO","Timeslots":[{"src":"SUN 2:00PM","rdate":"2014\/03\/30","rtime":"14:00:00"}]},{"SeriesTitle":"In Pursuit of Legends","SeriesID":"1067","EpisodeTitle":"Family Affair","EpisodeDescription":"Steve is joined by his son and nephew in eastern Colorado on an in your face archery antelope hunt for a Pope and Young buck. Marc heads to north central Wyoming for an intense November rifle Muley rut hunt. Deer are on their feet, and by the hundreds! No guides-No outfitters.","NewEpisode":"NO","Timeslots":[{"src":"TUE 8:30AM","rdate":"2014\/03\/25","rtime":"08:30:00"},{"src":"SAT 6:30AM","rdate":"2014\/03\/29","rtime":"06:30:00"}]},{"SeriesTitle":"In Pursuit of Legends","SeriesID":"1067","EpisodeTitle":"Ponderosa Dreams","EpisodeDescription":"Brandt chases down a monster pronghorn who attempts an escape at 350 yards in the eastern plains of Colorado. Steve and Brandt climb 30 feet into a ponderosa pine in the mountains of Colorado in pursuit of giant bull elk during the archery season. Dreams quickly become reality as a 360 inch class bull appears into the marshy tundra. Nerves are rattled in this heart pounding standoff. No guides-No outfitters.","NewEpisode":"YES","Timeslots":[{"src":"SAT 5:00PM","rdate":"2014\/03\/29","rtime":"17:00:00"}]},{"SeriesTitle":"In-Fisherman TV","SeriesID":"1068","EpisodeTitle":"Select Winter Situations","EpisodeDescription":"The In-Fisherman staff highlights the heart of winter fishing, as they use slash lures for river brown trout, go deep for giant blue cats, and ice bull bluegills from well-managed ponds.","NewEpisode":"NO","Timeslots":[{"src":"MON 8:00AM","rdate":"2014\/03\/24","rtime":"08:00:00"},{"src":"TUE 3:30PM","rdate":"2014\/03\/25","rtime":"15:30:00"},{"src":"THU 3:30AM","rdate":"2014\/03\/27","rtime":"03:30:00"},{"src":"FRI 6:00AM","rdate":"2014\/03\/28","rtime":"06:00:00"}]},{"SeriesTitle":"In-Fisherman TV","SeriesID":"1068","EpisodeTitle":"Hottest Things Happening","EpisodeDescription":"The In-Fisherman staff shares breakthrough strategies, as they use pioneering tactics for smallmouth buffalo, highlight new swimbait systems for largemouth bass, and outline the newest lures for ice walleyes. ","NewEpisode":"YES","Timeslots":[{"src":"SUN 9:30AM","rdate":"2014\/03\/30","rtime":"09:30:00"}]},{"SeriesTitle":"Into the Blue","SeriesID":"1071","EpisodeTitle":"Yellowtail vs. Shark","EpisodeDescription":"Captian Steve Rodger and Captain Scott Walker go after the Yellowtail but must catch the yellowtail predator that gets them first. ","NewEpisode":"NO","Timeslots":[{"src":"WED 3:30PM","rdate":"2014\/03\/26","rtime":"15:30:00"},{"src":"FRI 2:30AM","rdate":"2014\/03\/28","rtime":"02:30:00"}]},{"SeriesTitle":"Into the Blue","SeriesID":"1071","EpisodeTitle":"Isamorado Reef","EpisodeDescription":"Scott and Steve explore the bounty that the reef provides just off the coast from Islamorada, FL . ","NewEpisode":"NO","Timeslots":[{"src":"SUN 10:30AM","rdate":"2014\/03\/30","rtime":"10:30:00"}]},{"SeriesTitle":"Intrepid Outdoors ","SeriesID":"1072","EpisodeTitle":"Spanish Gould Pt. 1","EpisodeDescription":"After a very successful Coues Deer hunt with Rio Sinora Outfitters in 2012, Team Intrepid decided to head south once again the following spring to hunt Goulds Turkeys with Brad Fulk in Chihuahua Mexico. ","NewEpisode":"NO","Timeslots":[{"src":"MON 12:00PM","rdate":"2014\/03\/24","rtime":"12:00:00"},{"src":"WED 7:00AM","rdate":"2014\/03\/26","rtime":"07:00:00"}]},{"SeriesTitle":"Intrepid Outdoors ","SeriesID":"1072","EpisodeTitle":"Spanish Gould Pt. 2","EpisodeDescription":"After three successful archery hunts in the first two days, Mike Schmid is ready to fill his tags along with nephew Keaton Stevens. More great Goulds Turkey hunting ","NewEpisode":"YES","Timeslots":[{"src":"SAT 1:30PM","rdate":"2014\/03\/29","rtime":"13:30:00"}]},{"SeriesTitle":"Jarrett Edwards Outdoors","SeriesID":"1073","EpisodeTitle":"The More Species the Better","EpisodeDescription":"Jarrett and his guest tournament angler Kip Bennett fish the clear waters of Lake Powell Utah for a variety of multi species angling. What will they catch next?!","NewEpisode":"NO","Timeslots":[{"src":"MON 1:00PM","rdate":"2014\/03\/24","rtime":"13:00:00"},{"src":"FRI 7:00AM","rdate":"2014\/03\/28","rtime":"07:00:00"}]},{"SeriesTitle":"Jarrett Edwards Outdoors","SeriesID":"1073","EpisodeTitle":"Second Chances","EpisodeDescription":"Jarrett is joined by fellow Cancer survivor and tournament angler Chase Heaton as they battle large smallmouth bass on Washington’s Snake River.","NewEpisode":"YES","Timeslots":[{"src":"SAT 9:00AM","rdate":"2014\/03\/29","rtime":"09:00:00"}]},{"SeriesTitle":"King of the River","SeriesID":"1074","EpisodeTitle":"From Saint-Jean to York River","EpisodeDescription":"We will discover Little Indian Pool on the Saint-Jean River for some early morning fishing, then we'll dive on the bluff pool on the Saint-Jean river where host, and Benjamin go to dive to show how salmon are counted to determine the quantity that can be caught and we will finish the day on the exclusive White House Pool. ","NewEpisode":"NO","Timeslots":[{"src":"THU 7:00AM","rdate":"2014\/03\/27","rtime":"07:00:00"},{"src":"SAT 3:00AM","rdate":"2014\/03\/29","rtime":"03:00:00"}]},{"SeriesTitle":"King of the River","SeriesID":"1074","EpisodeTitle":"From Saint-Jean to York River","EpisodeDescription":"We will discover Little Indian Pool on the Saint-Jean River for some early morning fishing, then we'll dive on the bluff pool on the Saint-Jean river where host, and Benjamin go to dive to show how salmon are counted to determine the quantity that can be caught and we will finish the day on the exclusive White House Pool. ","NewEpisode":"NO","Timeslots":[{"src":"SUN 3:30PM","rdate":"2014\/03\/30","rtime":"15:30:00"}]},{"SeriesTitle":"Kings of Gettin'Em ","SeriesID":"1075","EpisodeTitle":"Late Season Bull Early Snow","EpisodeDescription":"Kings of Gettin’Em Andy Mack and Keith Cherry are in Chama New\nMexico on a late season Elk hunt. After 5 days and numerous\nencounters The Doc finally connects on a giant Chama Bull.","NewEpisode":"NO","Timeslots":[{"src":"TUE 9:30AM","rdate":"2014\/03\/25","rtime":"09:30:00"},{"src":"THU 6:00AM","rdate":"2014\/03\/27","rtime":"06:00:00"}]},{"SeriesTitle":"Kings of Gettin'Em ","SeriesID":"1075","EpisodeTitle":"Kansas Whitetail","EpisodeDescription":"Kings of Gettin’Em Keith Cherry and son Thomas Cherry are hunting\ngiant Whitetail in central Kansas. Keith is hunting with his bow in the\nmiddle of November. After 5 long days KC has an opportunity at a\nmature Kansas bruiser. Keith brings son Thomas back for a late season\nrifle hunt.","NewEpisode":"YES","Timeslots":[{"src":"SUN 5:00PM","rdate":"2014\/03\/30","rtime":"17:00:00"}]},{"SeriesTitle":"Leading Ladies Outdoors","SeriesID":"1078","EpisodeTitle":"Oh Canada! Black Bear Family Bowhunt","EpisodeDescription":"Paws and Claws! Tammy Koenig, her daughter Brittany and husband Peter travel to Redditt, Ontario Canada to bowhunt Black Bear. The bear are few and far between this year but Tammy and Peter manage to find some takers including an unusual cinnamon with a blonde stripe and a bear that seems to be all paws. Tammy’s daughter Brittany puts in long hard hours in the stand and deals with an unfortunate outcome. Hunting highs and lows come together in this exciting episode.","NewEpisode":"NO","Timeslots":[{"src":"TUE 10:30AM","rdate":"2014\/03\/25","rtime":"10:30:00"},{"src":"THU 4:30AM","rdate":"2014\/03\/27","rtime":"04:30:00"}]},{"SeriesTitle":"Leading Ladies Outdoors","SeriesID":"1078","EpisodeTitle":"Monster Bears & Mathews Bows","EpisodeDescription":"Monster Bear are tough to come by and even tougher to bowhunt unless you are in the tree with Tammy and Brittany of Leading Ladies Outdoors! Feel the ground shake when Brittany’s biggest bear to date saunters out of the bush. The Ladies are bringing home the bear bacon all the way from Ontario, Canada on this episode! Did you ever think a bear could be shot and not even know it? How about three in a row? Thanks to the Mathews Creed bow you will think you’re hitting the repeat button. You do not want to miss this unbelievable Big black bear bonanza!","NewEpisode":"YES","Timeslots":[{"src":"SUN 6:30PM","rdate":"2014\/03\/30","rtime":"18:30:00"}]},{"SeriesTitle":"Long Range Pursuit","SeriesID":"1081","EpisodeTitle":"British Columbia Black Bear with 2 guns","EpisodeDescription":"Aaron Davidson and Garrett Wall travel to Vancouver BC to hunt Black Bears. Garrett pulls of an amazing double, first with the Gunwerks 7LRM and the next with the Gunwerks Long Range Muzzleloader in a blinding 2 minutes. Jeremy Winters continues his instructional series with part 5 on cleaning and maintenance of a Long Range Rifle.","NewEpisode":"NO","Timeslots":[{"src":"FRI 10:00AM","rdate":"2014\/03\/28","rtime":"10:00:00"},{"src":"FRI 5:30PM","rdate":"2014\/03\/28","rtime":"17:30:00"},{"src":"SAT 2:00AM","rdate":"2014\/03\/29","rtime":"02:00:00"}]},{"SeriesTitle":"Long Range Pursuit","SeriesID":"1081","EpisodeTitle":"High Country Wyoming Elk","EpisodeDescription":"Mike Davidson gets pulled out of his comfort zone on a late season high country Wyoming elk hunt. Mike takes it to the wire with his Gunwerks 7LRM and gets a shot over 1000 yards on the last day of the hunt. Jeremy Winters begins a multiple episode segment on cleaning and maintenance for a Long Range Rifle.","NewEpisode":"NO","Timeslots":[{"src":"SAT 1:00PM","rdate":"2014\/03\/29","rtime":"13:00:00"}]},{"SeriesTitle":"Louisiana Outdoor Adventures","SeriesID":"1082","EpisodeTitle":"Pointe A La Hache Speckled Trout","EpisodeDescription":"When the weather cools off, the fishing heats up in Pointe A La Hache on the east bank of The Mississippi River in Plaquemines Parish. Today Captain Chris Danos shows us how easy it is to catch plenty of speckled trout within site of Bechel's Marina.","NewEpisode":"NO","Timeslots":[{"src":"TUE 3:00PM","rdate":"2014\/03\/25","rtime":"15:00:00"},{"src":"THU 3:00AM","rdate":"2014\/03\/27","rtime":"03:00:00"},{"src":"FRI 8:00AM","rdate":"2014\/03\/28","rtime":"08:00:00"}]},{"SeriesTitle":"Louisiana Outdoor Adventures","SeriesID":"1082","EpisodeTitle":"Dennis Bardwell Coastal Reds","EpisodeDescription":" Louisiana shrimp are some of the best in the world. On this episode of LOA, Dennis Bardwell takes down to the bottom of the Louisiana Coast out of Cypress Cove Marina in search of bull reds on topwater.","NewEpisode":"NO","Timeslots":[{"src":"SUN 9:00AM","rdate":"2014\/03\/30","rtime":"09:00:00"},{"src":"SUN 3:00PM","rdate":"2014\/03\/30","rtime":"15:00:00"}]},{"SeriesTitle":"Major League Bowhunter","SeriesID":"1083","EpisodeTitle":"Shared Information","EpisodeDescription":"Chipper hunts the Kansas river bottoms and uses information gained from Jeff after he hunted a few weeks prior with several encounters with mature bucks. Jeff in pursuit of a 183” giant passes up a deer name “Wallahachie Buck” and “Triple Crown”. Sharing what he’s learned he passes it along to Chipper as he prepares to hunt a week after Jeff puts down Huckleberry. This information leads to the “Wallahachie Buck” traveling a trail 20 yards in front of Chipper.","NewEpisode":"NO","Timeslots":[{"src":"TUE 8:30PM","rdate":"2014\/03\/25","rtime":"20:30:00"},{"src":"TUE 11:30PM","rdate":"2014\/03\/25","rtime":"23:30:00"},{"src":"WED 12:30PM","rdate":"2014\/03\/26","rtime":"12:30:00"},{"src":"SUN 2:30AM","rdate":"2014\/03\/30","rtime":"02:30:00"}]},{"SeriesTitle":"Mathew's Dominant Bucks","SeriesID":"1084","EpisodeTitle":"Lunar Lunacy","EpisodeDescription":"Join Whitetail Pro Stan Potts and the SoloCam Pros as they dive into the effects the moon has on whitetail deer. 2 deer hunts featuring Randy Baker and Joe Miles.","NewEpisode":"YES","Timeslots":[{"src":"WED 9:00PM","rdate":"2014\/03\/26","rtime":"21:00:00"},{"src":"THU 12:00AM","rdate":"2014\/03\/27","rtime":"00:00:00"},{"src":"THU 1:00PM","rdate":"2014\/03\/27","rtime":"13:00:00"},{"src":"FRI 11:00AM","rdate":"2014\/03\/28","rtime":"11:00:00"}]},{"SeriesTitle":"Maximum Archery","SeriesID":"1085","EpisodeTitle":"Wyoming Wild","EpisodeDescription":"Andy aims at taking Wyoming Prairie Dogs and other small game with the new Ambush Archery Bow. The adventure starts now…","NewEpisode":"NO","Timeslots":[{"src":"WED 11:30AM","rdate":"2014\/03\/26","rtime":"11:30:00"}]},{"SeriesTitle":"Maximum Archery","SeriesID":"1085","EpisodeTitle":"Best of Small Game","EpisodeDescription":"Andy Ross recaps the Best of his Big game hunts this far with his new Ambush Bow. ","NewEpisode":"NO","Timeslots":[{"src":"FRI 10:30PM","rdate":"2014\/03\/28","rtime":"22:30:00"},{"src":"SAT 1:30AM","rdate":"2014\/03\/29","rtime":"01:30:00"},{"src":"SAT 7:30AM","rdate":"2014\/03\/29","rtime":"07:30:00"}]},{"SeriesTitle":"Maximum Outdoors TV","SeriesID":"1086","EpisodeTitle":"Illinois Oops 2013","EpisodeDescription":"Join the boys as they head to Illinois for a late season bow hunt as Steve tries to film his own hunt, while\nChris tries his luck in the stand. this episode is jam pack with excitement.","NewEpisode":"NO","Timeslots":[{"src":"TUE 11:30AM","rdate":"2014\/03\/25","rtime":"11:30:00"}]},{"SeriesTitle":"Maximum Outdoors TV","SeriesID":"1086","EpisodeTitle":"Illinois Whitetails","EpisodeDescription":"Join the crew of Maximum Outdoors TV as Chris and Steve head to Illinois on a action pack trip Rut hunt.\nThe Crew is in for one heck of a Trip.","NewEpisode":"YES","Timeslots":[{"src":"SUN 7:30PM","rdate":"2014\/03\/30","rtime":"19:30:00"},{"src":"MON 4:30AM","rdate":"2014\/03\/24","rtime":"04:30:00"}]},{"SeriesTitle":"MeatEater ","SeriesID":"1087","EpisodeTitle":"Local Motion:Montana Bull Elk","EpisodeDescription":"Steve gets brutalized by bad weather and fierce competition during a late-season central Montana elk hunt.","NewEpisode":"NO","Timeslots":[{"src":"TUE 8:00AM","rdate":"2014\/03\/25","rtime":"08:00:00"}]},{"SeriesTitle":"MeatEater ","SeriesID":"1087","EpisodeTitle":"The Northern Rockies: BC Grizzley Pt 1","EpisodeDescription":"Steve and his buddy Ryan Callaghan, a British Columbia guide, hike into the steep backcountry of northern British Columbia in search of grizzlies. This alpine adventure includes some intense and up-close bear action – almost too close. ","NewEpisode":"YES","Timeslots":[{"src":"THU 8:00PM","rdate":"2014\/03\/27","rtime":"20:00:00"},{"src":"THU 11:00PM","rdate":"2014\/03\/27","rtime":"23:00:00"},{"src":"FRI 12:00AM","rdate":"2014\/03\/28","rtime":"00:00:00"},{"src":"SAT 11:00AM","rdate":"2014\/03\/29","rtime":"11:00:00"}]},{"SeriesTitle":"Mojo TV","SeriesID":"1090","EpisodeTitle":"Canadians Over Kansas","EpisodeDescription":"Mike Morgan heads to Kaqnsas and meets up with the fellas from Central Kansas Outfitters for three days of dry field hunting. The flocks are huge, the hunting is unreal and the action never lets up. Honk, Honk, BANG!","NewEpisode":"NO","Timeslots":[{"src":"MON 10:00AM","rdate":"2014\/03\/24","rtime":"10:00:00"},{"src":"WED 4:00AM","rdate":"2014\/03\/26","rtime":"04:00:00"}]},{"SeriesTitle":"Mojo TV","SeriesID":"1090","EpisodeTitle":"Pigeons, Pigeons, Pigeons!","EpisodeDescription":"MOJO makes its annual stop in Idaho to hunt pigeons with Neil hunt and the guys at Soar No More. There is no shortage of birds and along to do some blasting is Chad Belding and UFC's Scott Jorgensen.","NewEpisode":"YES","Timeslots":[{"src":"SAT 6:00PM","rdate":"2014\/03\/29","rtime":"18:00:00"}]},{"SeriesTitle":"Nock On TV","SeriesID":"1093","EpisodeTitle":"Bustin' Bulls","EpisodeDescription":"This is an episode that will show you some of the most amazing footage you have ever seen! This show is dedicated to the big bulls of Alberta and will surely keep your heart pounding. Watch as Nock On Host John Dudley and his crew members chase early season elk and late season moose with their bows. You simply wont believe it when you witness a Canadian Bull Moose who decides to come inside the blind after deciding where he heard the call come from. This episode will leave you feeling like something is breathing on your neck!","NewEpisode":"NO","Timeslots":[{"src":"WED 10:00AM","rdate":"2014\/03\/26","rtime":"10:00:00"},{"src":"FRI 4:00PM","rdate":"2014\/03\/28","rtime":"16:00:00"}]},{"SeriesTitle":"Nock On TV","SeriesID":"1093","EpisodeTitle":"Lobo Peakin'","EpisodeDescription":"Join the Nock On crew as they travel to the British Columbia wilderness to stalk, up close and personal, with some big black bears. This is an amazing episode that not only shows you the success of a great bear hunt but also teaches you along the way. Host John Dudley will walk you through some important facts about your archery gear and how to make sure you are doing everything right to be a deadly archer of your own.","NewEpisode":"NO","Timeslots":[{"src":"FRI 9:00PM","rdate":"2014\/03\/28","rtime":"21:00:00"},{"src":"SAT 12:00AM","rdate":"2014\/03\/29","rtime":"00:00:00"}]},{"SeriesTitle":"North American Whitetail","SeriesID":"1094","EpisodeTitle":"Patterning Late-Season Bucks","EpisodeDescription":"This week, the North American Whitetail team takes a close look at the importance of late-season food sources when it comes to cashing in your whitetail tag, Dr. Deer explains the importance of managing your doe herd, and Pat Hogan gets realistic about archery practice. All of this and more on North American Whitetail Television.","NewEpisode":"NO","Timeslots":[{"src":"WED 8:00AM","rdate":"2014\/03\/26","rtime":"08:00:00"}]},{"SeriesTitle":"North American Whitetail","SeriesID":"1094","EpisodeTitle":"A Tradition Continued","EpisodeDescription":"This week on North American Whitetail Television, Pat Hogan explores the history and future of muzzleloading at one of the biggest blackpowder gatherings in North America, Brent Beimert explains bare-shaft tuning for increased archery accuracy, and Dr. James Kroll provides tips on setting your property up to help young hunters succeed. All of this and more on North American Whitetail Television.","NewEpisode":"YES","Timeslots":[{"src":"WED 8:00PM","rdate":"2014\/03\/26","rtime":"20:00:00"},{"src":"WED 11:00PM","rdate":"2014\/03\/26","rtime":"23:00:00"},{"src":"THU 12:00PM","rdate":"2014\/03\/27","rtime":"12:00:00"},{"src":"SUN 6:30AM","rdate":"2014\/03\/30","rtime":"06:30:00"}]},{"SeriesTitle":"NRANews Cam & Co","SeriesID":"1095","EpisodeTitle":"","EpisodeDescription":"","NewEpisode":"NO","Timeslots":[{"src":"MON 6:00PM","rdate":"2014\/03\/24","rtime":"18:00:00"},{"src":"TUE 6:00PM","rdate":"2014\/03\/25","rtime":"18:00:00"},{"src":"WED 6:00PM","rdate":"2014\/03\/26","rtime":"18:00:00"},{"src":"THU 6:00PM","rdate":"2014\/03\/27","rtime":"18:00:00"},{"src":"FRI 6:00PM","rdate":"2014\/03\/28","rtime":"18:00:00"}]},{"SeriesTitle":"Oakley Big Bass Tour","SeriesID":"1096","EpisodeTitle":"Kelly Jordan Big Bass Classic","EpisodeDescription":"Richard Walkers takes home a brand new Nitro Z-8 Boat. Kenneth Anderson, college angler, fishes his first OBBT in Richland Chambers Lake, Texas. ","NewEpisode":"NO","Timeslots":[{"src":"SUN 7:00AM","rdate":"2014\/03\/30","rtime":"07:00:00"}]},{"SeriesTitle":"On the Road","SeriesID":"1097","EpisodeTitle":"Down Home Gators","EpisodeDescription":"Rock and Mal head down to the roots of Rock’s childhood to harvest gators with bow and enjoy some good Cajun cooking. ","NewEpisode":"NO","Timeslots":[{"src":"THU 11:30AM","rdate":"2014\/03\/27","rtime":"11:30:00"}]},{"SeriesTitle":"On the Road","SeriesID":"1097","EpisodeTitle":"MT Turkey","EpisodeDescription":"Rock, Kristi, and Mr Glenn set out in the SE corner of MT to chase some Merriam turkey.","NewEpisode":"NO","Timeslots":[{"src":"SAT 10:30PM","rdate":"2014\/03\/29","rtime":"22:30:00"},{"src":"SUN 1:30AM","rdate":"2014\/03\/30","rtime":"01:30:00"}]},{"SeriesTitle":"One More Cast with Shaw Grigsby","SeriesID":"1099","EpisodeTitle":"Bienville Bass","EpisodeDescription":"Shaw visits the fertile bass lakes of Bienville Plantation, a rugged, upside-down piece of terrain in north-central Florida. Lunker largemouths lurk under a dense thatch of water lettuce, where it takes a special combination of lure, line, and technique to penetrate to their hangouts. Along many stretches of shoreline, these secretive bass even live in thick tangles of grapevine spilling down in the water. Shaw shows how to hook ‘em up and pry ‘em out of these all but impossible places. ","NewEpisode":"NO","Timeslots":[{"src":"MON 2:30PM ","rdate":"2014\/03\/24","rtime":"14:30:00"},{"src":"TUE 4:00AM","rdate":"2014\/03\/25","rtime":"04:00:00"},{"src":"FRI 3:30PM","rdate":"2014\/03\/28","rtime":"15:30:00"}]},{"SeriesTitle":"One More Cast with Shaw Grigsby","SeriesID":"1099","EpisodeTitle":"Bobber Reds","EpisodeDescription":"He’s fished for reds throughout the Gulf Coast, but for Shaw’s money the best place to go for trophy redfish is the water near Venice, Louisiana. Specifically, the best spot to fish is from the deck of famous guide Mike Frenette’s boat. On open waters that look everywhere the same, Mike suddenly cuts the throttle, points a finger down like a water-witcher’s stick, and proclaims that right here is the spot. On this trip, he gives Shaw plenty of pointers on catching trophy reds with a popping-cork rig.","NewEpisode":"YES","Timeslots":[{"src":"SAT 10:30AM","rdate":"2014\/03\/29","rtime":"10:30:00"},{"src":"SUN 7:30AM","rdate":"2014\/03\/30","rtime":"07:30:00"}]},{"SeriesTitle":"Outback Outdoors","SeriesID":"1100","EpisodeTitle":"The Next Generation","EpisodeDescription":"Trevon heads into the aspen high country of Colorado with a young first time bowhunter. In this adventure Trev passes on the traditions and skills of bowhunting bugling bulls to the next generation.","NewEpisode":"NO","Timeslots":[{"src":"WED 11:00AM","rdate":"2014\/03\/26","rtime":"11:00:00"}]},{"SeriesTitle":"Outback Outdoors","SeriesID":"1100","EpisodeTitle":"The Big 8","EpisodeDescription":"Team Outback Outdoors’ start on their 2013 whitetail run and Trevon is joined by his dad in the treestand for an exciting “chess match” matching wits with a mature 8 point whitetail buck.","NewEpisode":"YES","Timeslots":[{"src":"FRI 10:00PM","rdate":"2014\/03\/28","rtime":"22:00:00"},{"src":"SAT 1:00AM","rdate":"2014\/03\/29","rtime":"01:00:00"}]},{"SeriesTitle":"Outfittersrating TV","SeriesID":"1101","EpisodeTitle":"Speedsters of the High Desert-New Mexico Pronghorn","EpisodeDescription":"Want big, record-class speed goats? Look to New Mexico and Limestone Guides and Outfitting Service to satisfy that itch. Darrel Welty owner\/guide shows host Doug Hamric so many record book pronghorn it makes choosing just one quite difficult. Doug scores on a great pronghorn trophy for the second season in a row. ","NewEpisode":"YES","Timeslots":[{"src":"WED 9:30PM","rdate":"2014\/03\/26","rtime":"21:30:00"},{"src":"THU 12:30AM","rdate":"2014\/03\/27","rtime":"00:30:00"},{"src":"THU 1:30PM","rdate":"2014\/03\/27","rtime":"13:30:00"}]},{"SeriesTitle":"Outlanders","SeriesID":"1102","EpisodeTitle":"High Winds, Sub Zero Temps, and The One","EpisodeDescription":"With four tags to fill husband and wife team Chad and Rene’ Parsons face mother nature at it’s worst… with high winds, sub zero temperatures, an no cover Chad may not get a chance to bag his biggest buck to date. ","NewEpisode":"NO","Timeslots":[{"src":"THU 10:00PM","rdate":"2014\/03\/27","rtime":"22:00:00"},{"src":"FRI 1:00AM","rdate":"2014\/03\/28","rtime":"01:00:00"},{"src":"FRI 2:00PM","rdate":"2014\/03\/28","rtime":"14:00:00"}]},{"SeriesTitle":"Over Yonder Outdoors","SeriesID":"1103","EpisodeTitle":"The Newcomers","EpisodeDescription":"We head North to the family farm of Caden to follow Jonathan and Caden as they fight tough conditions through all of October and November. Jonathan and Caden are newcomers to the crew this year, and you'll watch the good and the bad of their season as they chase mature whitetails with their Mathews on a well managed private farm. ","NewEpisode":"NO","Timeslots":[{"src":"TUE 10:00AM","rdate":"2014\/03\/25","rtime":"10:00:00"},{"src":"THU 4:00AM","rdate":"2014\/03\/27","rtime":"04:00:00"}]},{"SeriesTitle":"Over Yonder Outdoors","SeriesID":"1103","EpisodeTitle":"Bow Only","EpisodeDescription":"","NewEpisode":"NO","Timeslots":[{"src":"SUN 6:00PM","rdate":"2014\/03\/30","rtime":"18:00:00"}]},{"SeriesTitle":"Personal Defense","SeriesID":"1104","EpisodeTitle":"Maximizing Range Time","EpisodeDescription":"Richard Nance and professional shooter Jessie Duff teach viewers how to maximize their range time, and on Hand to Hand, Kelly McCann shows how to defend yourself if your back is to a wall. Dave Spaulding demonstrates how to do a slide-lock reload on Skills Drills, and on Survival Tools, James Tarr reviews Hornady’s Critical Defense Lite ammunition.","NewEpisode":"YES","Timeslots":[{"src":"MON 9:30PM","rdate":"2014\/03\/24","rtime":"21:30:00"},{"src":"TUE 12:30AM","rdate":"2014\/03\/25","rtime":"00:30:00"},{"src":"THU 5:00AM","rdate":"2014\/03\/27","rtime":"05:00:00"}]},{"SeriesTitle":"Petersen's HUNTING Adventures","SeriesID":"1105","EpisodeTitle":"Delta Buffalo","EpisodeDescription":"Mozambique holds great herds of Cape Buffalo and Craig Boddington is hot on their spoor.","NewEpisode":"NO","Timeslots":[{"src":"MON 6:30AM","rdate":"2014\/03\/24","rtime":"06:30:00"},{"src":"TUE 1:00PM","rdate":"2014\/03\/25","rtime":"13:00:00"}]},{"SeriesTitle":"Petersen's HUNTING Adventures","SeriesID":"1105","EpisodeTitle":"Washington Whitetails","EpisodeDescription":"Hunt Washington state’s whitetail hotspot, the Palouse River Valley with Mike Schoby and friends.","NewEpisode":"NO","Timeslots":[{"src":"SUN 9:00PM","rdate":"2014\/03\/30","rtime":"21:00:00"},{"src":"MON 12:00AM","rdate":"2014\/03\/24","rtime":"00:00:00"}]},{"SeriesTitle":"Phil Phillips Unleashed","SeriesID":"1106","EpisodeTitle":"Southwest Antelope Adventure","EpisodeDescription":"On his way to a favorite archery elk hunting destination Phil stops off for a muzzleloader antelope hunt in New Mexico.\n","NewEpisode":"NO","Timeslots":[{"src":"THU 11:00AM","rdate":"2014\/03\/27","rtime":"11:00:00"}]},{"SeriesTitle":"Phil Phillips Unleashed","SeriesID":"1106","EpisodeTitle":"Wyoming Screaming Bulls ","EpisodeDescription":"Phil Phillips hunts for bull elk during the peak in late September in SW Wyoming using his Mathews bow.","NewEpisode":"NO","Timeslots":[{"src":"SAT 10:00PM","rdate":"2014\/03\/29","rtime":"22:00:00"},{"src":"SUN 1:00AM","rdate":"2014\/03\/30","rtime":"01:00:00"}]},{"SeriesTitle":"PigMan: The Series","SeriesID":"1107","EpisodeTitle":"Dark Continent IV \"Road Trip\"","EpisodeDescription":"Pig Man is down to the final days of his African Safari and plans to go out with a bang. The guys at Comre Safaris bring him along on a South African roadtrip showing him everything they have to offer. Sable, wildebeest, bless buck, water buck, and kudo all meet their makers in this finale, and to top it all off, a last minute unexpected lynx hunt turns out to be one of the biggest highlights of the entire trip.","NewEpisode":"NO","Timeslots":[{"src":"TUE 12:00PM","rdate":"2014\/03\/25","rtime":"12:00:00"},{"src":"THU 6:30AM","rdate":"2014\/03\/27","rtime":"06:30:00"}]},{"SeriesTitle":"PigMan: The Series","SeriesID":"1107","EpisodeTitle":"Blood Drive","EpisodeDescription":"Pig Man hooks up with good friend Dave Reynerson in Louisiana and joins him on a twilight bowfishing excursion. No trip is complete however until Pig Man takes a stab at the local hog population. The guys meet up with Dr. Jim LaCour of the Louisiana Department of Wildlife and Fisheries and attempt to take down several hogs for their blood surveillance program. Using rifles and thermal equipment, the crew hopes to learn more about the disease prevalence in Louisiana.","NewEpisode":"NO","Timeslots":[{"src":"SUN 8:00PM","rdate":"2014\/03\/30","rtime":"20:00:00"},{"src":"SUN 11:00PM","rdate":"2014\/03\/30","rtime":"23:00:00"}]},{"SeriesTitle":"Practical Tactical","SeriesID":"1109","EpisodeTitle":"Home Intrusion Defense Plans","EpisodeDescription":"The key to any personal protection plan is getting the training necessary to properly defend yourself and your loved ones. Host, Rich Wyatt travels to Utah and the Counterterrorism Institute of America for training on what to do when an armed intruder breaks into your home. Self-defense expert, Theresa Byrne, is joined by the creator of the F.A.S.T. self defense system creator, Bill Kipp, for an emotional training session. Finally, Deputy Gerritt Kauffman and members of the Douglas County K-9 Unit show how man’s best friend can be an important line of defense.","NewEpisode":"NO","Timeslots":[{"src":"MON 7:00PM","rdate":"2014\/03\/24","rtime":"19:00:00"},{"src":"THU 7:00PM","rdate":"2014\/03\/27","rtime":"19:00:00"}]},{"SeriesTitle":"Practical Tactical","SeriesID":"1109","EpisodeTitle":"Bank Robbery Survival","EpisodeDescription":"Rich Wyatt, is at the Swanson Tactical Training Center in Utah with the Counterterrorism Institute of America to show viewers what to do if they ever find themselves in the middle of a bank robbery. Also, stun guns, tasers and pepper spray are all alternatives to carrying a handgun for self- defense, but do you know the proper tactics to use to defend yourself with these less-than-lethal weapons? Find out here.","NewEpisode":"NO","Timeslots":[{"src":"MON 7:30PM","rdate":"2014\/03\/24","rtime":"19:30:00"},{"src":"THU 7:30PM","rdate":"2014\/03\/27","rtime":"19:30:00"}]},{"SeriesTitle":"Practical Tactical","SeriesID":"1109","EpisodeTitle":"Taking Down Active Shooters","EpisodeDescription":"The Counterterrorism Institute of America specializes in training legally armed citizens for any dangerous situation they may face. In this episode of Practical Tactical, students and host, Rich Wyatt, will learn tactics on how to deal with an active shooter as a live drill is conducted at the Swanson Tactical Training Center in Ogden, Utah. Also profiled are tactics on handgun disarming and safety tips while using an ATM.","NewEpisode":"NO","Timeslots":[{"src":"TUE 7:00PM","rdate":"2014\/03\/25","rtime":"19:00:00"}]},{"SeriesTitle":"Practical Tactical","SeriesID":"1109","EpisodeTitle":"Swat Tactics","EpisodeDescription":"\"SWAT Teams, Special Weapons and Tactics, were first developed in 1968 by the LAPD. The duties of a SWAT team range from high-risk search warrants, to hostage rescue to counter-terrorism operations, but what can the average citizen learn from the tactics of SWAT? Rich Wyatt joins members of the Douglas County, Colorado SWAT team as they demonstrate how to clear a room, make an explosive entry and what to do if you ever find yourself in a hostage situation.\"","NewEpisode":"NO","Timeslots":[{"src":"TUE 7:30PM","rdate":"2014\/03\/25","rtime":"19:30:00"}]},{"SeriesTitle":"Practical Tactical","SeriesID":"1109","EpisodeTitle":"Home Invasion, Personal Safety & Pipe Bombs","EpisodeDescription":"One out of every six women will be assaulted at some point in their lives. Theresa Byrne shows how to fight off an intruder if he makes his way into your bedroom. Join the Counterterrorism Institute of America to learn the tactics that bodyguards use to keep high profile clients safe. Finally, learn about pipe bombs and both how and why they have become popular ways to do extreme damage. Parents: do you know what materials your kids could be using to make pipe bombs? We’ll show you.","NewEpisode":"NO","Timeslots":[{"src":"WED 7:00PM","rdate":"2014\/03\/26","rtime":"19:00:00"}]},{"SeriesTitle":"Practical Tactical","SeriesID":"1109","EpisodeTitle":"Civilian Crime Fighters","EpisodeDescription":"What if you are caught in the middle of an armed robbery, but you are not the victim? What would you do, and what are the steps you can take to help the innocent party in such a violent crime? Also, we’ll put a piece of safety equipment under the lights as we showcase an instrument that could help you and your family stay safe. Rich Wyatt and Michael Janich will also profile non-traditional weapons for those unexpected moments of danger when your firearm may not be readily available.","NewEpisode":"NO","Timeslots":[{"src":"WED 7:30PM","rdate":"2014\/03\/26","rtime":"19:30:00"}]},{"SeriesTitle":"Predator Instinct","SeriesID":"1110","EpisodeTitle":"Sneed Again","EpisodeDescription":"The Sneed ranch boys are back for an encore! Oh Brother, here we go again!\nIts always fun to hunt with good friends in some really cool country. Tyler and Walter have been a blast to hunt with, and they know their country well. Last year Clint and Tyler laid a whooping on Cal and Todd, Lets see if they can redeem themselves. \n","NewEpisode":"NO","Timeslots":[{"src":"TUE 9:00AM","rdate":"2014\/03\/25","rtime":"09:00:00"},{"src":"WED 4:30PM","rdate":"2014\/03\/26","rtime":"16:30:00"}]},{"SeriesTitle":"Predator Instinct","SeriesID":"110","EpisodeTitle":"Family Fun","EpisodeDescription":"Cal and his boys Brock and Cade head out for a little family hunting.\nIt's always a special time when you get to spend time with your family, doing the things you love to do. Join Cal, Brock and Cade on this family outing.\n","NewEpisode":"YES","Timeslots":[{"src":"SAT 5:30PM","rdate":"2014\/03\/29","rtime":"17:30:00"},{"src":"MON 3:30AM","rdate":"2014\/03\/24","rtime":"03:30:00"}]},{"SeriesTitle":"Predator Nation","SeriesID":"1111","EpisodeTitle":"Elusive Cats","EpisodeDescription":"The elusive bobcat is small, but its appetite is not. Learn how to be more successful on hunting these spotted cats.","NewEpisode":"NO","Timeslots":[{"src":"TUE 12:30PM","rdate":"2014\/03\/25","rtime":"12:30:00"}]},{"SeriesTitle":"Predator Nation","SeriesID":"1111","EpisodeTitle":"Going Non-Traditional on Predators","EpisodeDescription":"Fred shows how deadly two non-traditional weapons can be. Whether it’s in a suburban setting or out in the back woods. If you’ve never hunted predators with an air gun or crossbow, you’re not going to want to miss it. We’ll also be giving you a tour of one of the oldest air gun manufactures in the world, Crosman.","NewEpisode":"YES","Timeslots":[{"src":"SUN 8:30PM","rdate":"2014\/03\/30","rtime":"20:30:00"},{"src":"SUN 11:30PM","rdate":"2014\/03\/30","rtime":"23:30:00"}]},{"SeriesTitle":"Predator Pursuit","SeriesID":"1112","EpisodeTitle":"Canada Bears Pt. 2","EpisodeDescription":"Jeff and the winner of the Facebook contest Derek Connally are in Canada hunting black bears with Alberta Bear Busters. After the largest snow the camp has had in 20 years the guys get in the stands with hope of getting a trophy bear. Part#2","NewEpisode":"NO","Timeslots":[{"src":"MON 4:00PM","rdate":"2014\/03\/24","rtime":"16:00:00"}]},{"SeriesTitle":"Predator Pursuit","SeriesID":"1112","EpisodeTitle":"DPMS","EpisodeDescription":"Jeff and the guys from DPMS take the new G2 .308 rifle out to TX to see how it will take on some hogs and coyotes. ","NewEpisode":"YES","Timeslots":[{"src":"SAT 4:30PM","rdate":"2014\/03\/29","rtime":"16:30:00"},{"src":"MON 2:30AM","rdate":"2014\/03\/24","rtime":"02:30:00"}]},{"SeriesTitle":"Quack Shack Duck Show","SeriesID":"1116","EpisodeTitle":"Red River Ramble","EpisodeDescription":"Join the Quack Shack gang and JJ Kent for big fun on small water. ","NewEpisode":"NO","Timeslots":[{"src":"MON 8:30AM","rdate":"2014\/03\/24","rtime":"08:30:00"},{"src":"WED 2:30AM","rdate":"2014\/03\/26","rtime":"02:30:00"}]},{"SeriesTitle":"Quack Shack Duck Show","SeriesID":"1116","EpisodeTitle":"The Smell of Success","EpisodeDescription":"The Quack Shack Joins the Muddy Water Crew as the mallard migration hits Wichita Falls.","NewEpisode":"YES","Timeslots":[{"src":"SAT 2:30PM","rdate":"2014\/03\/29","rtime":"14:30:00"},{"src":"MON 3:00AM","rdate":"2014\/03\/24","rtime":"03:00:00"}]},{"SeriesTitle":"Realtree's Monster Bucks","SeriesID":"1118","EpisodeTitle":"Rattling\/Calling","EpisodeDescription":"Not many people will argue that one of the best ways to kill a mature buck is to call one in, but there are a lot of things that have to go right to be successful. Watch as some giant bucks are lured in close!","NewEpisode":"NO","Timeslots":[{"src":"TUE 8:00PM","rdate":"2014\/03\/25","rtime":"20:00:00"},{"src":"TUE 11:00PM","rdate":"2014\/03\/25","rtime":"23:00:00"},{"src":"WED 12:00PM","rdate":"2014\/03\/26","rtime":"12:00:00"}]},{"SeriesTitle":"Reel Time Florida Sportsman","SeriesID":"1119","EpisodeTitle":"Daytime Swordfish","EpisodeDescription":"Capt. George Gozdz joins Chip Sheehan (Chips Ahoy Charters on the Florida Sportsman forum) in Boynton Beach. They head offshore in the bay boat to target the coveted daytime swordfish. Learn the ins and outs of swordfishing from the top of the game. Don’t miss this adrenalin pumping episode.","NewEpisode":"NO","Timeslots":[{"src":"MON 3:30PM","rdate":"2014\/03\/24","rtime":"15:30:00"},{"src":"THU 2:30AM","rdate":"2014\/03\/27","rtime":"02:30:00"}]},{"SeriesTitle":"Reel Time Florida Sportsman","SeriesID":"1119","EpisodeTitle":"Marco Island","EpisodeDescription":"Capt. George Gozdz and Reel Time crew travel to Marco Island to explore the northern 10,000 islands. They meet up with local John Derrig and his friend Bill Jones to fish for what the area is famous for, snook and tarpon.","NewEpisode":"YES","Timeslots":[{"src":"SUN 8:30AM","rdate":"2014\/03\/30","rtime":"08:30:00"}]},{"SeriesTitle":"Relentless Pursuit","SeriesID":"1120","EpisodeTitle":"Devil's Horn","EpisodeDescription":"Tim closes in on the elusive Black Sable while the wild dangers of Africa follow him.","NewEpisode":"YES","Timeslots":[{"src":"WED 9:30AM","rdate":"2014\/03\/26","rtime":"09:30:00"}]},{"SeriesTitle":"Relentless Pursuit","SeriesID":"1120.000","EpisodeTitle":"Primeval","EpisodeDescription":"Tim reveals his lust for blood as he spear hunts the nocturnal Bush Pig in Mozambique. Meanwhile a hippo kills man and Lynn Thompson takes charge.","NewEpisode":"YES","Timeslots":[{"src":"FRI 8:30PM","rdate":"2014\/03\/28","rtime":"20:30:00"},{"src":"FRI 11:30PM","rdate":"2014\/03\/28","rtime":"23:30:00"}]},{"SeriesTitle":"RNT-V","SeriesID":"1122","EpisodeTitle":"Special Belly's!","EpisodeDescription":"Join John Stephens and friends for some up close and personal Speck hunting… Its why we call them Special Belly’s.\n","NewEpisode":"NO","Timeslots":[{"src":"WED 8:30AM","rdate":"2014\/03\/26","rtime":"08:30:00"}]},{"SeriesTitle":"RNT-V","SeriesID":"1122","EpisodeTitle":"A New Call is Born","EpisodeDescription":"Join Shawn Stahl and friends for an “up north” Canada Goose Hunt along with witnessing the making of a new Canada Goose call for RNT… The Micrgoose SS ","NewEpisode":"NO","Timeslots":[{"src":"SAT 3:00PM","rdate":"2014\/03\/29","rtime":"15:00:00"},{"src":"MON 2:00AM","rdate":"2014\/03\/24","rtime":"02:00:00"}]},{"SeriesTitle":"Safari Hunters Journal","SeriesID":"1125","EpisodeTitle":"In the Lion's Den","EpisodeDescription":"Nat Discovery has nothing on this shoot, as lions steal the GoPro and take off. The most unique footage ever seen as the GoPro collects live animal footage of running, and licking. ","NewEpisode":"NO","Timeslots":[{"src":"MON 7:00AM","rdate":"2014\/03\/24","rtime":"07:00:00"},{"src":"FRI 9:00AM","rdate":"2014\/03\/28","rtime":"09:00:00"}]},{"SeriesTitle":"Safari Hunters Journal","SeriesID":"1125","EpisodeTitle":"In Loving Memory","EpisodeDescription":"A tribute to our friend Greg Rodriguez. Featuring some of Greg's many appearances on show. Elephant and buffalo, as well as an in-studio discussion with him. \n","NewEpisode":"YES","Timeslots":[{"src":"SUN 12:00PM","rdate":"2014\/03\/30","rtime":"12:00:00"}]},{"SeriesTitle":"Saltwater Experience","SeriesID":"1126","EpisodeTitle":"Sandy Keys Variety","EpisodeDescription":"Hosts Tom Rowland and Rich Tudor venture deep into the Everglades at the peak of tarpon season for some awesome surface action and some other surprises.","NewEpisode":"NO","Timeslots":[{"src":"MON 3:00PM","rdate":"2014\/03\/24","rtime":"15:00:00"},{"src":"THU 2:00AM","rdate":"2014\/03\/27","rtime":"02:00:00"}]},{"SeriesTitle":"Saltwater Experience","SeriesID":"1126","EpisodeTitle":"Key West Harbor Tarpon","EpisodeDescription":"Steve Rodger, host of Into the Blue, guides Tom Rowland and Rich Tudor into historic Key West Harbor for giant tarpon.","NewEpisode":"NO","Timeslots":[{"src":"SUN 8:00AM","rdate":"2014\/03\/30","rtime":"08:00:00"}]},{"SeriesTitle":"Savage Outdoors ","SeriesID":"1127","EpisodeTitle":"New Mexico Elk","EpisodeDescription":"Mike Stroff and Uncle Randy both have tags in New Mexico for Elk. Mike is hunting the rut with his bow and gets up close and personal to a huge bull! Uncle Randy goes back to hunt with Fishtail Ranch during the rifle season and gets to see how many elk Chama, NM actually has!","NewEpisode":"YES","Timeslots":[{"src":"TUE 10:00PM","rdate":"2014\/03\/25","rtime":"22:00:00"},{"src":"WED 1:00AM","rdate":"2014\/03\/26","rtime":"01:00:00"},{"src":"WED 2:00PM","rdate":"2014\/03\/26","rtime":"14:00:00"},{"src":"SUN 3:00AM","rdate":"2014\/03\/30","rtime":"03:00:00"}]},{"SeriesTitle":"Silent Draw Outdoors","SeriesID":"1130","EpisodeTitle":"Boy Dreams Bears","EpisodeDescription":"This one's for the books and for the heart. Shaine and crew surprise 12 year old Dalton with an all expense paid\ntrip to hunt black bears with Shaine with True North Outfitters. Dalton is a cancer surviver who's dream was to\ncome out the other side a hunter. Nothing was going to stop Dalton and now his dreams may come true.","NewEpisode":"NO","Timeslots":[{"src":"THU 10:00AM","rdate":"2014\/03\/27","rtime":"10:00:00"}]},{"SeriesTitle":"Silent Draw Outdoors","SeriesID":"1130","EpisodeTitle":"Father Son Double Bears Down","EpisodeDescription":"After some great hunting with Dalton Hutchinson, it's now the Reece's turn. Shaine and his\nfather Terry embark on a unting adventure almost 40 years in the making. This marks the first\ntime Terry kills a bear with a bow and Shaine is right along side him. Emotions run high, action\nstays hot and Alberta Black Bears fall hard. Also Shaine and Terry attempt to take two bears\nfrom one treestand in less then an hour.\n","NewEpisode":"YES","Timeslots":[{"src":"SAT 9:00PM","rdate":"2014\/03\/29","rtime":"21:00:00"},{"src":"SUN 12:00AM","rdate":"2014\/03\/30","rtime":"00:00:00"}]},{"SeriesTitle":"Skull Bound TV","SeriesID":"1131","EpisodeTitle":"Hunting is Conservation","EpisodeDescription":"After donating a filmed hunt to the Rocky Mountain Elk Foundation, Host Jana Waller mentors 15 year old Emma on her first whitetail hunt in Montana. The pair spend the Youth Hunt weekend combing the mountains on a thrilling spot and stalk hunt that includes elk, mule deer and Emma’s first buck. Then it’s off to Oregon where Skull Bound and Pioneer Outfitters donated a hunt to raise money for the Mule Deer Foundation. The lucky winner of this hunt takes a 180+” 6x5 on day one after a 4 hour stalk in hurricane force winds. ","NewEpisode":"YES","Timeslots":[{"src":"WED 8:30PM","rdate":"2014\/03\/26","rtime":"20:30:00"},{"src":"WED 11:30PM","rdate":"2014\/03\/26","rtime":"23:30:00"},{"src":"THU 12:30PM","rdate":"2014\/03\/27","rtime":"12:30:00"},{"src":"SAT 2:30AM","rdate":"2014\/03\/29","rtime":"02:30:00"}]},{"SeriesTitle":"Strike King's Fish Hard","SeriesID":"1134","EpisodeTitle":"Lake Fork Joker","EpisodeDescription":"Crappie Pro, Wallt Marchall, Mr. Crappie, shows us how he fishes for crappie using the Mr. Crappie Joker by Strike King.","NewEpisode":"NO","Timeslots":[{"src":"MON 2:00PM","rdate":"2014\/03\/24","rtime":"14:00:00"},{"src":"FRI 3:00PM","rdate":"2014\/03\/28","rtime":"15:00:00"}]},{"SeriesTitle":"Strike King's Fish Hard","SeriesID":"1134","EpisodeTitle":"Lake Ouachita Fall","EpisodeDescription":"B.A.S.S Elite Tournament Anglers, Mark Davis & Todd Faircloth fish Mark's home lake, Lake Ouachita, for largemouth Bass using Strike King's Sexy Spoon and 6XD crankbaits. ","NewEpisode":"YES","Timeslots":[{"src":"SAT 10:00AM","rdate":"2014\/03\/29","rtime":"10:00:00"}]},{"SeriesTitle":"Tac TV ","SeriesID":"1135","EpisodeTitle":"The HK 21","EpisodeDescription":"Many HK weapons are favored by the Special Ops community and in the right situation, the HK21 is on that list. Perhaps the most unique belt fed machine gun yet designed, TacTV goes cyclic to discover what makes this gun so interesting. Other cutting edge tactical products are examined.","NewEpisode":"NO","Timeslots":[{"src":"MON 10:00PM","rdate":"2014\/03\/24","rtime":"22:00:00"},{"src":"TUE 1:00AM","rdate":"2014\/03\/25","rtime":"01:00:00"},{"src":"THU 5:30PM","rdate":"2014\/03\/27","rtime":"17:30:00"}]},{"SeriesTitle":"Tactical Impact","SeriesID":"1171","EpisodeTitle":"Hitting for Power: The Battle Rifle","EpisodeDescription":"Combat weapons firing a full sized, high powered cartridge were supposed to be a thing of the past, but recent engagements have challenged that. In this episode of Tactical Impact, our Hosts trace the evolution of the battle rifle, dissecting and firing many of the greatest examples of the species, from the mighty M1 Garand to the highly customized battle rifles many Special Ops soldiers are carrying today. In Choose Your Weapon, the Hosts and viewers at home must pick the best firearm to take on the Great Raid, and a special piece looks at the impact gun designer John Browning had on history.","NewEpisode":"NO","Timeslots":[{"src":"MON 5:30PM","rdate":"2014\/03\/24","rtime":"17:30:00"}]},{"SeriesTitle":"The Breakdown, presented by Southern Game Calls","SeriesID":"1138","EpisodeTitle":"Virginia Willow Blind","EpisodeDescription":"The whole SGC crew Rob, Kyle, Cole, Ken, and Matt are in OK hunting one of the few ponds that still have water in their area. The drought has dropped the water level to an all time low leaving them with no natural cover to hide from the ducks. Rob and Brad will breakdown this hunt and show you how they were able to stay hidden and be successful. You’ll get tips from the pros with Matt Jones of Southern Game Calls\/The Resistance tv and a Gear guide feature from Kyle Barefield All right here on The Breakdown, presented by Southern Game Calls.","NewEpisode":"NO","Timeslots":[{"src":"TUE 3:30AM","rdate":"2014\/03\/25","rtime":"03:30:00"},{"src":"TUE 6:30AM","rdate":"2014\/03\/25","rtime":"06:30:00"}]},{"SeriesTitle":"The Breakdown, presented by Southern Game Calls","SeriesID":"1138","EpisodeTitle":"Jayhawk Jamboree 2- KS Stellar Hunts","EpisodeDescription":"The whole SGC crew Rob, Kyle, Cole, Ken, and Matt are in OK hunting one of the few ponds that still have water in their area. The drought has dropped the water level to an all time low leaving them with no natural cover to hide from the ducks. Rob and Brad will breakdown this hunt and show you how they were able to stay hidden and be successful. You’ll get tips from the pros with Matt Jones of Southern Game Calls\/The Resistance tv and a Gear guide feature from Kyle Barefield All right here on The Breakdown, presented by Southern Game Calls.","NewEpisode":"YES","Timeslots":[{"src":"SAT 3:30PM","rdate":"2014\/03\/29","rtime":"15:30:00"}]},{"SeriesTitle":"The Edge","SeriesID":"1140","EpisodeTitle":"Trouble Bruin Part 2","EpisodeDescription":"After a successful black bear hunt in Alberta with NHL'er David Booth, Ryan Kohler deals with the media attention that this hunt has received. Consulting Ted Nugent for advice, and discussing the advantages of bear baiting, Kohler continues to hunt bears. This may be the most controversial episode in the hunting industry, ever. Trouble Bruin Part Two.","NewEpisode":"NO","Timeslots":[{"src":"WED 2:00AM","rdate":"2014\/03\/26","rtime":"02:00:00"},{"src":"THU 8:30AM","rdate":"2014\/03\/27","rtime":"08:30:00"}]},{"SeriesTitle":"The Edge","SeriesID":"1140","EpisodeTitle":"Manitoba Caribou","EpisodeDescription":"Ryan Kohler travels to the subarctic tundra of Northern Manitoba, and is after Caribou with archery equipment. This action packed episode reveals that hunting Caribou with archery equipment isn't very easy. Ryan does everything he can to fill his archery caribou tag. You don't want to miss this one!","NewEpisode":"NO","Timeslots":[{"src":"SAT 4:00PM","rdate":"2014\/03\/29","rtime":"16:00:00"}]},{"SeriesTitle":"The Gypsy Angler with Ray Van Horn","SeriesID":"1141","EpisodeTitle":"TOP Water Everglades","EpisodeDescription":"Ray fishes with RageTail Lure designer, Steve Parks, in the Florida Everglades for a mixed bag of species. ","NewEpisode":"NO","Timeslots":[{"src":"MON 1:30PM","rdate":"2014\/03\/24","rtime":"13:30:00"},{"src":"FRI 7:30AM","rdate":"2014\/03\/28","rtime":"07:30:00"}]},{"SeriesTitle":"The Gypsy Angler with Ray Van Horn","SeriesID":"1141","EpisodeTitle":"BAM! Venice Top Water","EpisodeDescription":"Ray fishes with guide Mike Frenette for huge redfish on topwater in the waters near Venice, Louisiana.","NewEpisode":"NO","Timeslots":[{"src":"SAT 9:30AM","rdate":"2014\/03\/29","rtime":"09:30:00"}]},{"SeriesTitle":"The Life at Table Mountain","SeriesID":"1143","EpisodeTitle":"Clayton Frame's First Pronghorn Hunt","EpisodeDescription":"Clayton Fame heads to Wyoming from Ohio for his very first Pronghorn Antelope hunt. ","NewEpisode":"NO","Timeslots":[{"src":"THU 8:00AM","rdate":"2014\/03\/27","rtime":"08:00:00"},{"src":"SUN 2:00AM","rdate":"2014\/03\/30","rtime":"02:00:00"}]},{"SeriesTitle":"The Life at Table Mountain","SeriesID":"1143","EpisodeTitle":"Ron Lentz Combo Hunt","EpisodeDescription":"Ron Lentz hunts Elk and Mule Deer with Table Mountain Outfitters.","NewEpisode":"NO","Timeslots":[{"src":"SUN 4:30PM","rdate":"2014\/03\/30","rtime":"16:30:00"}]},{"SeriesTitle":"The Outdoor Option","SeriesID":"1144","EpisodeTitle":"Texas 3-Step","EpisodeDescription":"Grandpa Cecil joins Danny, Shannon and Dan on a trip of a lifetime to South Texas after some big Whitetails. ","NewEpisode":"YES","Timeslots":[{"src":"MON 11:30AM","rdate":"2014\/03\/24","rtime":"11:30:00"},{"src":"TUE 4:30PM","rdate":"2014\/03\/25","rtime":"16:30:00"},{"src":"FRI 4:30AM","rdate":"2014\/03\/28","rtime":"04:30:00"}]},{"SeriesTitle":"The Outdoor Option","SeriesID":"1144","EpisodeTitle":"Turkey Time","EpisodeDescription":"The team is headed to Tennessee for some great turkey hunting. These are some hunts you won’t want to miss.","NewEpisode":"YES","Timeslots":[{"src":"SAT 7:30PM","rdate":"2014\/03\/29","rtime":"19:30:00"}]},{"SeriesTitle":"The Season with Justin Martin","SeriesID":"1147","EpisodeTitle":"KS Bowhunting Big Bucks Part 2 of 2","EpisodeDescription":"Justin is still trying to get a big buck on the ground, but everything seems to be stacked against him. Brutal weather and conditions make this a hunt where the weak need not apply.","NewEpisode":"NO","Timeslots":[{"src":"MON 6:00AM","rdate":"2014\/03\/24","rtime":"06:00:00"},{"src":"TUE 1:30PM","rdate":"2014\/03\/25","rtime":"13:30:00"}]},{"SeriesTitle":"The Season with Justin Martin","SeriesID":"1147","EpisodeTitle":"Corpus Christi Ducks","EpisodeDescription":"Justin is back with the gang and his old friend Geoff Austin hunting ducks on the Laguna Madre. Plenty of laughs and incredible duck hunting.","NewEpisode":"NO","Timeslots":[{"src":"SUN 9:30PM","rdate":"2014\/03\/30","rtime":"21:30:00"},{"src":"SUN 12:30PM","rdate":"2014\/03\/30","rtime":"12:30:00"}]},{"SeriesTitle":"The Sporting Chef","SeriesID":"1148","EpisodeTitle":"Venison Made Easier","EpisodeDescription":"What’s crispy, sweet, spicy and sour? Host Scott Leysath’s “Crunchy Venison Stir-Fry.” Find out how to put the crunch into this delicious dish. Also, Leysath checks in with his favorite fishmonger who explains the differences between shrimp and prawns just before dropping them onto a hot griddle, the best way to prep your meals before leaving for camp, Tiffany Haugen cans venison, Stacy Harris creates a stick-to-your-ribs sweet potato and venison dish and Buddy T has a sit-down with some mushrooms.","NewEpisode":"NO","Timeslots":[{"src":"MON 9:00AM","rdate":"2014\/03\/24","rtime":"09:00:00"},{"src":"WED 3:00AM","rdate":"2014\/03\/26","rtime":"03:00:00"}]},{"SeriesTitle":"The Sporting Chef","SeriesID":"1148","EpisodeTitle":"Fast, Hot & Fishy","EpisodeDescription":"Camp Chef’s new Artisan Pizza Oven is put to the task with Elk Backstrap and fresh Coho Salmon by Chef Leysath. At 700+ degrees, it should be done faster than you can say, “Don’t overcook it!” Tommy Gomes tears into a Leopard Shark and then cooks the good part, Chef Chris Logan shows why a fire extinguisher should always be nearby when he’s cooking grouper, Cee Dub puts the cure to cast iron, you’ll learn how to make any fish taste better and Buddy takes dead aim at the head of a prehistoric-looking fish. ","NewEpisode":"NO","Timeslots":[{"src":"SAT 11:30AM","rdate":"2014\/03\/29","rtime":"11:30:00"}]},{"SeriesTitle":"Tom Gruenwald Outdoors","SeriesID":"1153","EpisodeTitle":"Wind Power on Ice","EpisodeDescription":"Most serious ice anglers realize the importance of motion in their presentation—that little bit of added ‘triggering’ action that varies from species to species, season to season, lake to lake, day to day. They fully understand how important it is to experiment, working to determine just the right combination of subtle movement(s) that will consistently trigger strikes from their target species—so they always pay special attention to fine presentational details as they’re jigging. \n\nMany ice anglers, however, seem to overlook this important aspect of a refined presentation when planning their tip-up strategies…but that’s not so with Windlass fanatics! In this episode, host Tom Gruenwald and fellow pro staffer Aron Kastern head onto the ice demonstrating the advantages and versatility of wind-powered tip-ups, all while showing how to properly use, set and effectively rig these often misunderstood--yet incredibly productive and often underutilized specialty tip-ups!\n\n","NewEpisode":"NO","Timeslots":[{"src":"SAT 8:00AM","rdate":"2014\/03\/29","rtime":"08:00:00"}]},{"SeriesTitle":"Turkey Man","SeriesID":"1159","EpisodeTitle":"Southern Hot","EpisodeDescription":"Eddie Salter and his Flextone team are “getting it done down south”. This team wastes no time in piling up more southern turkeys, while Eddie shows his knowledge by breaking down the do’s and don’t of some of these great hunts.","NewEpisode":"NO","Timeslots":[{"src":"THU 9:30AM","rdate":"2014\/03\/27","rtime":"09:30:00"}]},{"SeriesTitle":"Turkey Man","SeriesID":"1159","EpisodeTitle":"Mixed Bag Turkey Tactics","EpisodeDescription":"The hunters on the Flextone Team are hard at it again with some awesome hunts using new decoys and some sweet turkey talkin'. Its a mixed bag of turkey hunting tactics from Tennessee to Nebraska. Eddie and friends hunt from opening day, all the way through late season. Join Cody Cutler as he takes the Kansas state record turkey with a bow !","NewEpisode":"YES","Timeslots":[{"src":"SAT 8:30PM","rdate":"2014\/03\/29","rtime":"20:30:00"},{"src":"SAT 11:30PM","rdate":"2014\/03\/29","rtime":"23:30:00"}]},{"SeriesTitle":"Waterfowl Obsession","SeriesID":"1162","EpisodeTitle":"Spring Snow Goose Showdown","EpisodeDescription":"Join Scott Butz and Fred Zink Sr. through their week long spring snow goose hunting adventure with Migrator Valley Outfitters. Be prepared for lots of geese…and lots of laughs in this one-of-a-kind episode. ","NewEpisode":"NO","Timeslots":[{"src":"MON 12:30PM","rdate":"2014\/03\/24","rtime":"12:30:00"},{"src":"FRI 8:30AM","rdate":"2014\/03\/28","rtime":"08:30:00"}]},{"SeriesTitle":"Waterfowl Obsession","SeriesID":"1162","EpisodeTitle":"No Wind Juvies","EpisodeDescription":"Join Waterfowl Obsession host Scott Butz and the 24-7 Productions crew as they begin their 4 week journey chasing snow geese in Saskatchewan with Larson Lake Outfitters. Watch the struggles and success of their epic trip.","NewEpisode":"NO","Timeslots":[{"src":"SAT 2:00PM","rdate":"2014\/03\/29","rtime":"14:00:00"},{"src":"SUN 6:00AM","rdate":"2014\/03\/30","rtime":"06:00:00"}]},{"SeriesTitle":"Where in the World is Colorado Buck ","SeriesID":"1163","EpisodeTitle":"Pigs & Ladies Hunt","EpisodeDescription":"Colorado Buck teams up with Southern Women Outdoors (SWO) and takes some ladies into the country for a some hog wild adventures through Longhorn Outfitters. Also for those in the market to purchase the right piece of land, you don’t want to miss your chance as this 1250 acre ranch in Goree Texas. ","NewEpisode":"NO","Timeslots":[{"src":"TUE 4:30AM","rdate":"2014\/03\/25","rtime":"04:30:00"},{"src":"FRI 11:30AM","rdate":"2014\/03\/28","rtime":"11:30:00"}]},{"SeriesTitle":"Where in the World is Colorado Buck ","SeriesID":"1163","EpisodeTitle":"Alaska Newsom Family Bear Hunt","EpisodeDescription":"Alaska is never an easy place to hunt, and in this episode you will find out how grizzly bears can really take over your black bear hunt. Join Colorado and the Newsom Family as they venture out 170 miles north of Fairbanks with Alaska Wilderness Enterprises, Joe Letarte, in search form Trophy Black Bear. The black bear are there… but so are the Interior Grizzlies. ","NewEpisode":"YES","Timeslots":[{"src":"SUN 5:30PM","rdate":"2014\/03\/30","rtime":"17:30:00"}]},{"SeriesTitle":"Whitetail Properties ","SeriesID":"1164","EpisodeTitle":"Big Chocolate","EpisodeDescription":"Three story lines will converge on the Rennecker Family Farm in Pike Co, IL in search of a buck known as Big Chocolate….","NewEpisode":"YES","Timeslots":[{"src":"TUE 9:30PM","rdate":"2014\/03\/25","rtime":"21:30:00"},{"src":"WED 12:30AM","rdate":"2014\/03\/26","rtime":"00:30:00"},{"src":"WED 1:30PM ","rdate":"2014\/03\/26","rtime":"13:30:00"}]},{"SeriesTitle":"Whitetail SLAM","SeriesID":"1165","EpisodeTitle":"Desert Coues Whitetail","EpisodeDescription":"Discuss the unique characteristics and hunting nuances of pursuing the desert coues whitetail. Known as the smallest hunt-able whitetail the desert coues deer is shy and secretive. BOWHUNTS INCLUDE DAVE WATSON AND TOM MIRANDA","NewEpisode":"NO","Timeslots":[{"src":"WED 10:00PM","rdate":"2014\/03\/26","rtime":"22:00:00"},{"src":"THUR 1:00AM","rdate":"2014\/03\/27","rtime":"02:00:00"},{"src":"THU 2:00PM","rdate":"2014\/03\/27","rtime":"14:00:00"}]},{"SeriesTitle":"YETI's Ultimate Hunt","SeriesID":"1169","EpisodeTitle":"Andy Ross","EpisodeDescription":"Maximum Archery” host, musician, and entrepreneur Andy Ross is a jack of all trades. Join Andy as Yeti’s Ultimate Hunt visits Nashville, TN for a closer look at the man behind the guitar highlighting memorable hunts from mako sharks to rattlesnakes and more.","NewEpisode":"YES","Timeslots":[{"src":"THU 10:30PM","rdate":"2014\/03\/27","rtime":"22:30:00"},{"src":"THU 1:30AM","rdate":"2014\/03\/27","rtime":"01:30:00"},{"src":"FRI 2:30PM","rdate":"2014\/03\/28","rtime":"14:30:00"}]},{"SeriesTitle":"YoungWild","SeriesID":"1170","EpisodeTitle":"Yukon Stone Sheep pt. 1","EpisodeDescription":"Join Lincoln Tapp on the most ambitious big game hunt of his life as he hunts on horseback for a Stone Sheep in some of the most beautiful land in North America, the Yukon. This epic journey is full of close calls, dangerous situations, and amazing cinematography. ","NewEpisode":"NO","Timeslots":[{"src":"WED 10:30AM","rdate":"2014\/03\/26","rtime":"10:30:00"}]},{"SeriesTitle":"YoungWild","SeriesID":"1170","EpisodeTitle":"Yukon Stone Sheep Pt. 2","EpisodeDescription":"Part two of an epic adventure in the Yukon. Lincoln finds himself standing 5 yards above a 39 inch Fannin Ram. With only seconds to space he’s forced to stand, draw, aim and release at the same time. This remarkable event makes Lincoln the Youngest known hunter to harvest a Stone Sheep with a bow. ","NewEpisode":"YES","Timeslots":[{"src":"FRI 9:00PM","rdate":"2014\/03\/28","rtime":"21:00:00"},{"src":"SAT 12:30AM","rdate":"2014\/03\/29","rtime":"00:30:00"}]}]